ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263P/CONTROLSS_INTXBAR_CONTROLSS_502D5000h.xml
<module name="CONTROLSS" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="CONTROLSS_INTXBAR0_G0" acronym="CONTROLSS_INTXBAR0_G0" offset="256" width="32" description="INT XBAR 0 Input Select.">
		<bitfield id="INTXBAR0_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM INT interrupt to corresponding XBAR1:PWMx.INT is selected0:PWMx.INT is de-selected x can have value from 0 to 31 corresponding to each PWM instance" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR0_G1" acronym="CONTROLSS_INTXBAR0_G1" offset="260" width="32" description="INT XBAR 0 Input Select.">
		<bitfield id="INTXBAR0_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM TZINT interrupt to corresponding XBAR1:PWMx.TZINT is selected0:PWMx.TZINT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR0_G2" acronym="CONTROLSS_INTXBAR0_G2" offset="264" width="32" description="INT XBAR 0 Input Select.">
		<bitfield id="INTXBAR0_G2_SEL" width="32" begin="31" end="0" resetval="0x0" description="Corresponding INT XBAR G2 Input SelectBit0:ADC0.INT1Bit1:ADC0.INT2Bit2:ADC0.INT3Bit3:ADC0.INT4Bit4:ADC0.EVTINTBit5:ADC1.INT1Bit6:ADC1.INT2Bit7:ADC1.INT3Bit8:ADC1.INT4Bit9:ADC1.EVTINTBit10:ADC2.INT1Bit11:ADC2.INT2Bit12:ADC2.INT3Bit13:ADC2.INT4Bit14:ADC2.EVTINTBit15:ADC3.INT1Bit16:ADC3.INT2Bit17:ADC3.INT3Bit18:ADC3.INT4Bit19:ADC3.EVTINTBit20:ADC4.INT1Bit21:ADC4.INT2Bit22:ADC4.INT3Bit23:ADC4.INT4Bit24:ADC4.EVTINTBit 2530:ReservedBit31:ASC_AGG0.INT" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR0_G3" acronym="CONTROLSS_INTXBAR0_G3" offset="268" width="32" description="INT XBAR 0 Input Select.">
		<bitfield id="INTXBAR0_G3_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G3 Input Select0:FSIRX0.INT1N1:FSIRX0.INT2N2:FSIRX1.INT1N3:FSIRX1.INT2N4:FSIRX2.INT1N5:FSIRX2.INT2N6:FSIRX3.INT1N7:FSIRX3.INT2N8:FSITX0.INT1N9:FSITX0.INT2N10:FSITX1.INT1N11:FSITX1.INT2N12:FSITX2.INT1N13:FSITX2.INT2N14:FSITX3.INT1N15:FSITX3.INT2N" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR0_G4" acronym="CONTROLSS_INTXBAR0_G4" offset="272" width="32" description="INT XBAR 0 Input Select.">
		<bitfield id="INTXBAR0_G4_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G4 Input Select0:SD0.ERR1:SD0.FILT1.DRINT2:SD0.FILT2.DRINT3:SD0.FILT3.DRINT4:SD0.FILT4.DRINT5:SD1.ERR6:SD1.FILT1.DRINT7:SD1.FILT2.DRINT8:SD1.FILT3.DRINT9:SD1.FILT4.DRINT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR0_G5" acronym="CONTROLSS_INTXBAR0_G5" offset="276" width="32" description="INT XBAR 0 Input Select.">
		<bitfield id="INTXBAR0_G5_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G5 Input Select0:ECAP0.INT1:ECAP1.INT2:ECAP2.INT3:ECAP3.INT4:ECAP4.INT5:ECAP5.INT6:ECAP6.INT7:ECAP7.INT8:ECAP8.INT9:ECAP9.INT10:ECAP10.INT11:ECAP11.INT12:ECAP12.INT13:ECAP13.INT14:ECAP14.INT15:ECAP15.INT" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR0_G6" acronym="CONTROLSS_INTXBAR0_G6" offset="280" width="32" description="INT XBAR 0 Input Select.">
		<bitfield id="INTXBAR0_G6_SEL" width="3" begin="2" end="0" resetval="0x0" description="Corresponding INT XBAR G6 Input Select0:EQEP0.INT1:EQEP1.INT2:EQEP2.INT" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR0_G7" acronym="CONTROLSS_INTXBAR0_G7" offset="284" width="32" description="INT XBAR 0 Input Select.">
		<bitfield id="INTXBAR0_G7_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G7 Input SelectBit0:ADCR0.INT1Bit1:ADCR0.INT2Bit2:ADCR0.INT3Bit3:ADCR0.INT4Bit4:ADCR0.EVTINTBit5:ADCR1.INT1Bit6:ADCR1.INT2Bit7:ADCR1.INT3Bit8:ADCR1.INT4Bit9:ADCR1.EVTINTBit 1031:Reserved" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR0_G8" acronym="CONTROLSS_INTXBAR0_G8" offset="288" width="32" description="INT XBAR 0 Input Select.">
		<bitfield id="INTXBAR0_G8_SEL" width="20" begin="19" end="0" resetval="0x0" description="Corresponding INT XBAR G8 Input Select0:CMP12SSA0.CTRIPL1:CMP12SSA0.CTRIPH2:CMP12SSA1.CTRIPL3:CMP12SSA1.CTRIPH4:CMP12SSA2.CTRIPL5:CMP12SSA2.CTRIPH6:CMP12SSA3.CTRIPL7:CMP12SSA3.CTRIPH8:CMP12SSA4.CTRIPL9:CMP12SSA4.CTRIPH10:CMP12SSA5.CTRIPL11:CMP12SSA5.CTRIPH12:CMP12SSA6.CTRIPL13:CMP12SSA6.CTRIPH14:CMP12SSA7.CTRIPL15:CMP12SSA7.CTRIPH16:CMP12SSA8.CTRIPL17:CMP12SSA8.CTRIPH18:CMP12SSA9.CTRIPL19:CMP12SSA9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR0_G9" acronym="CONTROLSS_INTXBAR0_G9" offset="292" width="32" description="INT XBAR 0 Input Select.">
		<bitfield id="INTXBAR0_G9_SEL" width="20" begin="19" end="0" resetval="0x0" description="Corresponding INT XBAR G9 Input Select0:CMP12SSB0.CTRIPL1:CMP12SSB0.CTRIPH2:CMP12SSB1.CTRIPL3:CMP12SSB1.CTRIPH4:CMP12SSB2.CTRIPL5:CMP12SSB2.CTRIPH6:CMP12SSB3.CTRIPL7:CMP12SSB3.CTRIPH8:CMP12SSB4.CTRIPL9:CMP12SSB4.CTRIPH10:CMP12SSB5.CTRIPL11:CMP12SSB5.CTRIPH12:CMP12SSB6.CTRIPL13:CMP12SSB6.CTRIPH14:CMP12SSB7.CTRIPL15:CMP12SSB7.CTRIPH16:CMP12SSB8.CTRIPL17:CMP12SSB8.CTRIPH18:CMP12SSB9.CTRIPL19:CMP12SSB9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR1_G0" acronym="CONTROLSS_INTXBAR1_G0" offset="320" width="32" description="INT XBAR 1 Input Select.">
		<bitfield id="INTXBAR1_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM INT interrupt to corresponding XBAR1:PWMx.INT is selected0:PWMx.INT is de-selected x can have value from  0 to 31 corresponding to each PWM instance" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR1_G1" acronym="CONTROLSS_INTXBAR1_G1" offset="324" width="32" description="INT XBAR 1 Input Select.">
		<bitfield id="INTXBAR1_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM TZINT interrupt to corresponding XBAR1:PWMx.TZINT is selected0:PWMx.TZINT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR1_G2" acronym="CONTROLSS_INTXBAR1_G2" offset="328" width="32" description="INT XBAR 1 Input Select.">
		<bitfield id="INTXBAR1_G2_SEL" width="32" begin="31" end="0" resetval="0x0" description="Corresponding INT XBAR G2 Input SelectBit0:ADC0.INT1Bit1:ADC0.INT2Bit2:ADC0.INT3Bit3:ADC0.INT4Bit4:ADC0.EVTINTBit5:ADC1.INT1Bit6:ADC1.INT2Bit7:ADC1.INT3Bit8:ADC1.INT4Bit9:ADC1.EVTINTBit10:ADC2.INT1Bit11:ADC2.INT2Bit12:ADC2.INT3Bit13:ADC2.INT4Bit14:ADC2.EVTINTBit15:ADC3.INT1Bit16:ADC3.INT2Bit17:ADC3.INT3Bit18:ADC3.INT4Bit19:ADC3.EVTINTBit20:ADC4.INT1Bit21:ADC4.INT2Bit22:ADC4.INT3Bit23:ADC4.INT4Bit24:ADC4.EVTINTBit 2530:ReservedBit31:ASC_AGG0.INT" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR1_G3" acronym="CONTROLSS_INTXBAR1_G3" offset="332" width="32" description="INT XBAR 1 Input Select.">
		<bitfield id="INTXBAR1_G3_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G3 Input Select0:FSIRX0.INT1N1:FSIRX0.INT2N2:FSIRX1.INT1N3:FSIRX1.INT2N4:FSIRX2.INT1N5:FSIRX2.INT2N6:FSIRX3.INT1N7:FSIRX3.INT2N8:FSITX0.INT1N9:FSITX0.INT2N10:FSITX1.INT1N11:FSITX1.INT2N12:FSITX2.INT1N13:FSITX2.INT2N14:FSITX3.INT1N15:FSITX3.INT2N" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR1_G4" acronym="CONTROLSS_INTXBAR1_G4" offset="336" width="32" description="INT XBAR 1 Input Select.">
		<bitfield id="INTXBAR1_G4_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G4 Input Select0:SD0.ERR1:SD0.FILT1.DRINT2:SD0.FILT2.DRINT3:SD0.FILT3.DRINT4:SD0.FILT4.DRINT5:SD1.ERR6:SD1.FILT1.DRINT7:SD1.FILT2.DRINT8:SD1.FILT3.DRINT9:SD1.FILT4.DRINT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR1_G5" acronym="CONTROLSS_INTXBAR1_G5" offset="340" width="32" description="INT XBAR 1 Input Select.">
		<bitfield id="INTXBAR1_G5_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G5 Input Select0:ECAP0.INT1:ECAP1.INT2:ECAP2.INT3:ECAP3.INT4:ECAP4.INT5:ECAP5.INT6:ECAP6.INT7:ECAP7.INT8:ECAP8.INT9:ECAP9.INT10:ECAP10.INT11:ECAP11.INT12:ECAP12.INT13:ECAP13.INT14:ECAP14.INT15:ECAP15.INT" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR1_G6" acronym="CONTROLSS_INTXBAR1_G6" offset="344" width="32" description="INT XBAR 1 Input Select.">
		<bitfield id="INTXBAR1_G6_SEL" width="3" begin="2" end="0" resetval="0x0" description="Corresponding INT XBAR G6 Input Select0:EQEP0.INT1:EQEP1.INT2:EQEP2.INT" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR1_G7" acronym="CONTROLSS_INTXBAR1_G7" offset="348" width="32" description="INT XBAR 1 Input Select.">
		<bitfield id="INTXBAR1_G7_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G7 Input SelectBit0:ADCR0.INT1Bit1:ADCR0.INT2Bit2:ADCR0.INT3Bit3:ADCR0.INT4Bit4:ADCR0.EVTINTBit5:ADCR1.INT1Bit6:ADCR1.INT2Bit7:ADCR1.INT3Bit8:ADCR1.INT4Bit9:ADCR1.EVTINTBit 1031:Reserved" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR1_G8" acronym="CONTROLSS_INTXBAR1_G8" offset="352" width="32" description="INT XBAR 1 Input Select.">
		<bitfield id="INTXBAR1_G8_SEL" width="20" begin="19" end="0" resetval="0x0" description="Corresponding INT XBAR G8 Input Select0:CMP12SSA0.CTRIPL1:CMP12SSA0.CTRIPH2:CMP12SSA1.CTRIPL3:CMP12SSA1.CTRIPH4:CMP12SSA2.CTRIPL5:CMP12SSA2.CTRIPH6:CMP12SSA3.CTRIPL7:CMP12SSA3.CTRIPH8:CMP12SSA4.CTRIPL9:CMP12SSA4.CTRIPH10:CMP12SSA5.CTRIPL11:CMP12SSA5.CTRIPH12:CMP12SSA6.CTRIPL13:CMP12SSA6.CTRIPH14:CMP12SSA7.CTRIPL15:CMP12SSA7.CTRIPH16:CMP12SSA8.CTRIPL17:CMP12SSA8.CTRIPH18:CMP12SSA9.CTRIPL19:CMP12SSA9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR1_G9" acronym="CONTROLSS_INTXBAR1_G9" offset="356" width="32" description="INT XBAR 1 Input Select.">
		<bitfield id="INTXBAR1_G9_SEL" width="20" begin="19" end="0" resetval="0x0" description="Corresponding INT XBAR G9 Input Select0:CMP12SSB0.CTRIPL1:CMP12SSB0.CTRIPH2:CMP12SSB1.CTRIPL3:CMP12SSB1.CTRIPH4:CMP12SSB2.CTRIPL5:CMP12SSB2.CTRIPH6:CMP12SSB3.CTRIPL7:CMP12SSB3.CTRIPH8:CMP12SSB4.CTRIPL9:CMP12SSB4.CTRIPH10:CMP12SSB5.CTRIPL11:CMP12SSB5.CTRIPH12:CMP12SSB6.CTRIPL13:CMP12SSB6.CTRIPH14:CMP12SSB7.CTRIPL15:CMP12SSB7.CTRIPH16:CMP12SSB8.CTRIPL17:CMP12SSB8.CTRIPH18:CMP12SSB9.CTRIPL19:CMP12SSB9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR2_G0" acronym="CONTROLSS_INTXBAR2_G0" offset="384" width="32" description="INT XBAR 2 Input Select.">
		<bitfield id="INTXBAR2_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM INT interrupt to corresponding XBAR1:PWMx.INT is selected0:PWMx.INT is de-selected x can have value from  0 to 31 corresponding to each PWM instance" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR2_G1" acronym="CONTROLSS_INTXBAR2_G1" offset="388" width="32" description="INT XBAR 2 Input Select.">
		<bitfield id="INTXBAR2_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM TZINT interrupt to corresponding XBAR1:PWMx.TZINT is selected0:PWMx.TZINT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR2_G2" acronym="CONTROLSS_INTXBAR2_G2" offset="392" width="32" description="INT XBAR 2 Input Select.">
		<bitfield id="INTXBAR2_G2_SEL" width="32" begin="31" end="0" resetval="0x0" description="Corresponding INT XBAR G2 Input SelectBit0:ADC0.INT1Bit1:ADC0.INT2Bit2:ADC0.INT3Bit3:ADC0.INT4Bit4:ADC0.EVTINTBit5:ADC1.INT1Bit6:ADC1.INT2Bit7:ADC1.INT3Bit8:ADC1.INT4Bit9:ADC1.EVTINTBit10:ADC2.INT1Bit11:ADC2.INT2Bit12:ADC2.INT3Bit13:ADC2.INT4Bit14:ADC2.EVTINTBit15:ADC3.INT1Bit16:ADC3.INT2Bit17:ADC3.INT3Bit18:ADC3.INT4Bit19:ADC3.EVTINTBit20:ADC4.INT1Bit21:ADC4.INT2Bit22:ADC4.INT3Bit23:ADC4.INT4Bit24:ADC4.EVTINTBit 2530:ReservedBit31:ASC_AGG0.INT" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR2_G3" acronym="CONTROLSS_INTXBAR2_G3" offset="396" width="32" description="INT XBAR 2 Input Select.">
		<bitfield id="INTXBAR2_G3_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G3 Input Select0:FSIRX0.INT1N1:FSIRX0.INT2N2:FSIRX1.INT1N3:FSIRX1.INT2N4:FSIRX2.INT1N5:FSIRX2.INT2N6:FSIRX3.INT1N7:FSIRX3.INT2N8:FSITX0.INT1N9:FSITX0.INT2N10:FSITX1.INT1N11:FSITX1.INT2N12:FSITX2.INT1N13:FSITX2.INT2N14:FSITX3.INT1N15:FSITX3.INT2N" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR2_G4" acronym="CONTROLSS_INTXBAR2_G4" offset="400" width="32" description="INT XBAR 2 Input Select.">
		<bitfield id="INTXBAR2_G4_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G4 Input Select0:SD0.ERR1:SD0.FILT1.DRINT2:SD0.FILT2.DRINT3:SD0.FILT3.DRINT4:SD0.FILT4.DRINT5:SD1.ERR6:SD1.FILT1.DRINT7:SD1.FILT2.DRINT8:SD1.FILT3.DRINT9:SD1.FILT4.DRINT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR2_G5" acronym="CONTROLSS_INTXBAR2_G5" offset="404" width="32" description="INT XBAR 2 Input Select.">
		<bitfield id="INTXBAR2_G5_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G5 Input Select0:ECAP0.INT1:ECAP1.INT2:ECAP2.INT3:ECAP3.INT4:ECAP4.INT5:ECAP5.INT6:ECAP6.INT7:ECAP7.INT8:ECAP8.INT9:ECAP9.INT10:ECAP10.INT11:ECAP11.INT12:ECAP12.INT13:ECAP13.INT14:ECAP14.INT15:ECAP15.INT" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR2_G6" acronym="CONTROLSS_INTXBAR2_G6" offset="408" width="32" description="INT XBAR 2 Input Select.">
		<bitfield id="INTXBAR2_G6_SEL" width="3" begin="2" end="0" resetval="0x0" description="Corresponding INT XBAR G6 Input Select0:EQEP0.INT1:EQEP1.INT2:EQEP2.INT" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR2_G7" acronym="CONTROLSS_INTXBAR2_G7" offset="412" width="32" description="INT XBAR 2 Input Select.">
		<bitfield id="INTXBAR2_G7_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G7 Input SelectBit0:ADCR0.INT1Bit1:ADCR0.INT2Bit2:ADCR0.INT3Bit3:ADCR0.INT4Bit4:ADCR0.EVTINTBit5:ADCR1.INT1Bit6:ADCR1.INT2Bit7:ADCR1.INT3Bit8:ADCR1.INT4Bit9:ADCR1.EVTINTBit 1031:Reserved" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR2_G8" acronym="CONTROLSS_INTXBAR2_G8" offset="416" width="32" description="INT XBAR 2 Input Select.">
		<bitfield id="INTXBAR2_G8_SEL" width="20" begin="19" end="0" resetval="0x0" description="Corresponding INT XBAR G8 Input Select0:CMP12SSA0.CTRIPL1:CMP12SSA0.CTRIPH2:CMP12SSA1.CTRIPL3:CMP12SSA1.CTRIPH4:CMP12SSA2.CTRIPL5:CMP12SSA2.CTRIPH6:CMP12SSA3.CTRIPL7:CMP12SSA3.CTRIPH8:CMP12SSA4.CTRIPL9:CMP12SSA4.CTRIPH10:CMP12SSA5.CTRIPL11:CMP12SSA5.CTRIPH12:CMP12SSA6.CTRIPL13:CMP12SSA6.CTRIPH14:CMP12SSA7.CTRIPL15:CMP12SSA7.CTRIPH16:CMP12SSA8.CTRIPL17:CMP12SSA8.CTRIPH18:CMP12SSA9.CTRIPL19:CMP12SSA9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR2_G9" acronym="CONTROLSS_INTXBAR2_G9" offset="420" width="32" description="INT XBAR 2 Input Select.">
		<bitfield id="INTXBAR2_G9_SEL" width="20" begin="19" end="0" resetval="0x0" description="Corresponding INT XBAR G9 Input Select0:CMP12SSB0.CTRIPL1:CMP12SSB0.CTRIPH2:CMP12SSB1.CTRIPL3:CMP12SSB1.CTRIPH4:CMP12SSB2.CTRIPL5:CMP12SSB2.CTRIPH6:CMP12SSB3.CTRIPL7:CMP12SSB3.CTRIPH8:CMP12SSB4.CTRIPL9:CMP12SSB4.CTRIPH10:CMP12SSB5.CTRIPL11:CMP12SSB5.CTRIPH12:CMP12SSB6.CTRIPL13:CMP12SSB6.CTRIPH14:CMP12SSB7.CTRIPL15:CMP12SSB7.CTRIPH16:CMP12SSB8.CTRIPL17:CMP12SSB8.CTRIPH18:CMP12SSB9.CTRIPL19:CMP12SSB9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR3_G0" acronym="CONTROLSS_INTXBAR3_G0" offset="448" width="32" description="INT XBAR 3 Input Select.">
		<bitfield id="INTXBAR3_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM INT interrupt to corresponding XBAR1:PWMx.INT is selected0:PWMx.INT is de-selected x can have value from  0 to 31 corresponding to each PWM instance" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR3_G1" acronym="CONTROLSS_INTXBAR3_G1" offset="452" width="32" description="INT XBAR 3 Input Select.">
		<bitfield id="INTXBAR3_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM TZINT interrupt to corresponding XBAR1:PWMx.TZINT is selected0:PWMx.TZINT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR3_G2" acronym="CONTROLSS_INTXBAR3_G2" offset="456" width="32" description="INT XBAR 3 Input Select.">
		<bitfield id="INTXBAR3_G2_SEL" width="32" begin="31" end="0" resetval="0x0" description="Corresponding INT XBAR G2 Input SelectBit0:ADC0.INT1Bit1:ADC0.INT2Bit2:ADC0.INT3Bit3:ADC0.INT4Bit4:ADC0.EVTINTBit5:ADC1.INT1Bit6:ADC1.INT2Bit7:ADC1.INT3Bit8:ADC1.INT4Bit9:ADC1.EVTINTBit10:ADC2.INT1Bit11:ADC2.INT2Bit12:ADC2.INT3Bit13:ADC2.INT4Bit14:ADC2.EVTINTBit15:ADC3.INT1Bit16:ADC3.INT2Bit17:ADC3.INT3Bit18:ADC3.INT4Bit19:ADC3.EVTINTBit20:ADC4.INT1Bit21:ADC4.INT2Bit22:ADC4.INT3Bit23:ADC4.INT4Bit24:ADC4.EVTINTBit 2530:ReservedBit31:ASC_AGG0.INT" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR3_G3" acronym="CONTROLSS_INTXBAR3_G3" offset="460" width="32" description="INT XBAR 3 Input Select.">
		<bitfield id="INTXBAR3_G3_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G3 Input Select0:FSIRX0.INT1N1:FSIRX0.INT2N2:FSIRX1.INT1N3:FSIRX1.INT2N4:FSIRX2.INT1N5:FSIRX2.INT2N6:FSIRX3.INT1N7:FSIRX3.INT2N8:FSITX0.INT1N9:FSITX0.INT2N10:FSITX1.INT1N11:FSITX1.INT2N12:FSITX2.INT1N13:FSITX2.INT2N14:FSITX3.INT1N15:FSITX3.INT2N" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR3_G4" acronym="CONTROLSS_INTXBAR3_G4" offset="464" width="32" description="INT XBAR 3 Input Select.">
		<bitfield id="INTXBAR3_G4_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G4 Input Select0:SD0.ERR1:SD0.FILT1.DRINT2:SD0.FILT2.DRINT3:SD0.FILT3.DRINT4:SD0.FILT4.DRINT5:SD1.ERR6:SD1.FILT1.DRINT7:SD1.FILT2.DRINT8:SD1.FILT3.DRINT9:SD1.FILT4.DRINT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR3_G5" acronym="CONTROLSS_INTXBAR3_G5" offset="468" width="32" description="INT XBAR 3 Input Select.">
		<bitfield id="INTXBAR3_G5_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G5 Input Select0:ECAP0.INT1:ECAP1.INT2:ECAP2.INT3:ECAP3.INT4:ECAP4.INT5:ECAP5.INT6:ECAP6.INT7:ECAP7.INT8:ECAP8.INT9:ECAP9.INT10:ECAP10.INT11:ECAP11.INT12:ECAP12.INT13:ECAP13.INT14:ECAP14.INT15:ECAP15.INT" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR3_G6" acronym="CONTROLSS_INTXBAR3_G6" offset="472" width="32" description="INT XBAR 3 Input Select.">
		<bitfield id="INTXBAR3_G6_SEL" width="3" begin="2" end="0" resetval="0x0" description="Corresponding INT XBAR G6 Input Select0:EQEP0.INT1:EQEP1.INT2:EQEP2.INT" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR3_G7" acronym="CONTROLSS_INTXBAR3_G7" offset="476" width="32" description="INT XBAR 3 Input Select.">
		<bitfield id="INTXBAR3_G7_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G7 Input SelectBit0:ADCR0.INT1Bit1:ADCR0.INT2Bit2:ADCR0.INT3Bit3:ADCR0.INT4Bit4:ADCR0.EVTINTBit5:ADCR1.INT1Bit6:ADCR1.INT2Bit7:ADCR1.INT3Bit8:ADCR1.INT4Bit9:ADCR1.EVTINTBit 1031:Reserved" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR3_G8" acronym="CONTROLSS_INTXBAR3_G8" offset="480" width="32" description="INT XBAR 3 Input Select.">
		<bitfield id="INTXBAR3_G8_SEL" width="20" begin="19" end="0" resetval="0x0" description="Corresponding INT XBAR G8 Input Select0:CMP12SSA0.CTRIPL1:CMP12SSA0.CTRIPH2:CMP12SSA1.CTRIPL3:CMP12SSA1.CTRIPH4:CMP12SSA2.CTRIPL5:CMP12SSA2.CTRIPH6:CMP12SSA3.CTRIPL7:CMP12SSA3.CTRIPH8:CMP12SSA4.CTRIPL9:CMP12SSA4.CTRIPH10:CMP12SSA5.CTRIPL11:CMP12SSA5.CTRIPH12:CMP12SSA6.CTRIPL13:CMP12SSA6.CTRIPH14:CMP12SSA7.CTRIPL15:CMP12SSA7.CTRIPH16:CMP12SSA8.CTRIPL17:CMP12SSA8.CTRIPH18:CMP12SSA9.CTRIPL19:CMP12SSA9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR3_G9" acronym="CONTROLSS_INTXBAR3_G9" offset="484" width="32" description="INT XBAR 3 Input Select.">
		<bitfield id="INTXBAR3_G9_SEL" width="20" begin="19" end="0" resetval="0x0" description="Corresponding INT XBAR G9 Input Select0:CMP12SSB0.CTRIPL1:CMP12SSB0.CTRIPH2:CMP12SSB1.CTRIPL3:CMP12SSB1.CTRIPH4:CMP12SSB2.CTRIPL5:CMP12SSB2.CTRIPH6:CMP12SSB3.CTRIPL7:CMP12SSB3.CTRIPH8:CMP12SSB4.CTRIPL9:CMP12SSB4.CTRIPH10:CMP12SSB5.CTRIPL11:CMP12SSB5.CTRIPH12:CMP12SSB6.CTRIPL13:CMP12SSB6.CTRIPH14:CMP12SSB7.CTRIPL15:CMP12SSB7.CTRIPH16:CMP12SSB8.CTRIPL17:CMP12SSB8.CTRIPH18:CMP12SSB9.CTRIPL19:CMP12SSB9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR4_G0" acronym="CONTROLSS_INTXBAR4_G0" offset="512" width="32" description="INT XBAR 4 Input Select.">
		<bitfield id="INTXBAR4_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM INT interrupt to corresponding XBAR1:PWMx.INT is selected0:PWMx.INT is de-selected x can have value from  0 to 31 corresponding to each PWM instance" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR4_G1" acronym="CONTROLSS_INTXBAR4_G1" offset="516" width="32" description="INT XBAR 4 Input Select.">
		<bitfield id="INTXBAR4_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM TZINT interrupt to corresponding XBAR1:PWMx.TZINT is selected0:PWMx.TZINT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR4_G2" acronym="CONTROLSS_INTXBAR4_G2" offset="520" width="32" description="INT XBAR 4 Input Select.">
		<bitfield id="INTXBAR4_G2_SEL" width="32" begin="31" end="0" resetval="0x0" description="Corresponding INT XBAR G2 Input SelectBit0:ADC0.INT1Bit1:ADC0.INT2Bit2:ADC0.INT3Bit3:ADC0.INT4Bit4:ADC0.EVTINTBit5:ADC1.INT1Bit6:ADC1.INT2Bit7:ADC1.INT3Bit8:ADC1.INT4Bit9:ADC1.EVTINTBit10:ADC2.INT1Bit11:ADC2.INT2Bit12:ADC2.INT3Bit13:ADC2.INT4Bit14:ADC2.EVTINTBit15:ADC3.INT1Bit16:ADC3.INT2Bit17:ADC3.INT3Bit18:ADC3.INT4Bit19:ADC3.EVTINTBit20:ADC4.INT1Bit21:ADC4.INT2Bit22:ADC4.INT3Bit23:ADC4.INT4Bit24:ADC4.EVTINTBit 2530:ReservedBit31:ASC_AGG0.INT" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR4_G3" acronym="CONTROLSS_INTXBAR4_G3" offset="524" width="32" description="INT XBAR 4 Input Select.">
		<bitfield id="INTXBAR4_G3_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G3 Input Select0:FSIRX0.INT1N1:FSIRX0.INT2N2:FSIRX1.INT1N3:FSIRX1.INT2N4:FSIRX2.INT1N5:FSIRX2.INT2N6:FSIRX3.INT1N7:FSIRX3.INT2N8:FSITX0.INT1N9:FSITX0.INT2N10:FSITX1.INT1N11:FSITX1.INT2N12:FSITX2.INT1N13:FSITX2.INT2N14:FSITX3.INT1N15:FSITX3.INT2N" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR4_G4" acronym="CONTROLSS_INTXBAR4_G4" offset="528" width="32" description="INT XBAR 4 Input Select.">
		<bitfield id="INTXBAR4_G4_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G4 Input Select0:SD0.ERR1:SD0.FILT1.DRINT2:SD0.FILT2.DRINT3:SD0.FILT3.DRINT4:SD0.FILT4.DRINT5:SD1.ERR6:SD1.FILT1.DRINT7:SD1.FILT2.DRINT8:SD1.FILT3.DRINT9:SD1.FILT4.DRINT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR4_G5" acronym="CONTROLSS_INTXBAR4_G5" offset="532" width="32" description="INT XBAR 4 Input Select.">
		<bitfield id="INTXBAR4_G5_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G5 Input Select0:ECAP0.INT1:ECAP1.INT2:ECAP2.INT3:ECAP3.INT4:ECAP4.INT5:ECAP5.INT6:ECAP6.INT7:ECAP7.INT8:ECAP8.INT9:ECAP9.INT10:ECAP10.INT11:ECAP11.INT12:ECAP12.INT13:ECAP13.INT14:ECAP14.INT15:ECAP15.INT" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR4_G6" acronym="CONTROLSS_INTXBAR4_G6" offset="536" width="32" description="INT XBAR 4 Input Select.">
		<bitfield id="INTXBAR4_G6_SEL" width="3" begin="2" end="0" resetval="0x0" description="Corresponding INT XBAR G6 Input Select0:EQEP0.INT1:EQEP1.INT2:EQEP2.INT" range="2:0" rwaccess="R/W"/>
