ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263P/CONTROLSS_INTXBAR_CONTROLSS_502D5000h.xml
		<bitfield id="INTXBAR13_G9_SEL" width="20" begin="19" end="0" resetval="0x0" description="Corresponding INT XBAR G9 Input Select0:CMP12SSB0.CTRIPL1:CMP12SSB0.CTRIPH2:CMP12SSB1.CTRIPL3:CMP12SSB1.CTRIPH4:CMP12SSB2.CTRIPL5:CMP12SSB2.CTRIPH6:CMP12SSB3.CTRIPL7:CMP12SSB3.CTRIPH8:CMP12SSB4.CTRIPL9:CMP12SSB4.CTRIPH10:CMP12SSB5.CTRIPL11:CMP12SSB5.CTRIPH12:CMP12SSB6.CTRIPL13:CMP12SSB6.CTRIPH14:CMP12SSB7.CTRIPL15:CMP12SSB7.CTRIPH16:CMP12SSB8.CTRIPL17:CMP12SSB8.CTRIPH18:CMP12SSB9.CTRIPL19:CMP12SSB9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR14_G0" acronym="CONTROLSS_INTXBAR14_G0" offset="1152" width="32" description="INT XBAR 14 Input Select.">
		<bitfield id="INTXBAR14_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM INT interrupt to corresponding XBAR1:PWMx.INT is selected0:PWMx.INT is de-selected x can have value from  0 to 31 corresponding to each PWM instance" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR14_G1" acronym="CONTROLSS_INTXBAR14_G1" offset="1156" width="32" description="INT XBAR 14 Input Select.">
		<bitfield id="INTXBAR14_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM TZINT interrupt to corresponding XBAR1:PWMx.TZINT is selected0:PWMx.TZINT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR14_G2" acronym="CONTROLSS_INTXBAR14_G2" offset="1160" width="32" description="INT XBAR 14 Input Select.">
		<bitfield id="INTXBAR14_G2_SEL" width="32" begin="31" end="0" resetval="0x0" description="Corresponding INT XBAR G2 Input SelectBit0:ADC0.INT1Bit1:ADC0.INT2Bit2:ADC0.INT3Bit3:ADC0.INT4Bit4:ADC0.EVTINTBit5:ADC1.INT1Bit6:ADC1.INT2Bit7:ADC1.INT3Bit8:ADC1.INT4Bit9:ADC1.EVTINTBit10:ADC2.INT1Bit11:ADC2.INT2Bit12:ADC2.INT3Bit13:ADC2.INT4Bit14:ADC2.EVTINTBit15:ADC3.INT1Bit16:ADC3.INT2Bit17:ADC3.INT3Bit18:ADC3.INT4Bit19:ADC3.EVTINTBit20:ADC4.INT1Bit21:ADC4.INT2Bit22:ADC4.INT3Bit23:ADC4.INT4Bit24:ADC4.EVTINTBit 2530:ReservedBit31:ASC_AGG0.INT" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR14_G3" acronym="CONTROLSS_INTXBAR14_G3" offset="1164" width="32" description="INT XBAR 14 Input Select.">
		<bitfield id="INTXBAR14_G3_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G3 Input Select0:FSIRX0.INT1N1:FSIRX0.INT2N2:FSIRX1.INT1N3:FSIRX1.INT2N4:FSIRX2.INT1N5:FSIRX2.INT2N6:FSIRX3.INT1N7:FSIRX3.INT2N8:FSITX0.INT1N9:FSITX0.INT2N10:FSITX1.INT1N11:FSITX1.INT2N12:FSITX2.INT1N13:FSITX2.INT2N14:FSITX3.INT1N15:FSITX3.INT2N" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR14_G4" acronym="CONTROLSS_INTXBAR14_G4" offset="1168" width="32" description="INT XBAR 14 Input Select.">
		<bitfield id="INTXBAR14_G4_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G4 Input Select0:SD0.ERR1:SD0.FILT1.DRINT2:SD0.FILT2.DRINT3:SD0.FILT3.DRINT4:SD0.FILT4.DRINT5:SD1.ERR6:SD1.FILT1.DRINT7:SD1.FILT2.DRINT8:SD1.FILT3.DRINT9:SD1.FILT4.DRINT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR14_G5" acronym="CONTROLSS_INTXBAR14_G5" offset="1172" width="32" description="INT XBAR 14 Input Select.">
		<bitfield id="INTXBAR14_G5_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G5 Input Select0:ECAP0.INT1:ECAP1.INT2:ECAP2.INT3:ECAP3.INT4:ECAP4.INT5:ECAP5.INT6:ECAP6.INT7:ECAP7.INT8:ECAP8.INT9:ECAP9.INT10:ECAP10.INT11:ECAP11.INT12:ECAP12.INT13:ECAP13.INT14:ECAP14.INT15:ECAP15.INT" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR14_G6" acronym="CONTROLSS_INTXBAR14_G6" offset="1176" width="32" description="INT XBAR 14 Input Select.">
		<bitfield id="INTXBAR14_G6_SEL" width="3" begin="2" end="0" resetval="0x0" description="Corresponding INT XBAR G6 Input Select0:EQEP0.INT1:EQEP1.INT2:EQEP2.INT" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR14_G7" acronym="CONTROLSS_INTXBAR14_G7" offset="1180" width="32" description="INT XBAR 14 Input Select.">
		<bitfield id="INTXBAR14_G7_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G7 Input SelectBit0:ADCR0.INT1Bit1:ADCR0.INT2Bit2:ADCR0.INT3Bit3:ADCR0.INT4Bit4:ADCR0.EVTINTBit5:ADCR1.INT1Bit6:ADCR1.INT2Bit7:ADCR1.INT3Bit8:ADCR1.INT4Bit9:ADCR1.EVTINTBit 1031:Reserved" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR14_G8" acronym="CONTROLSS_INTXBAR14_G8" offset="1184" width="32" description="INT XBAR 14 Input Select.">
		<bitfield id="INTXBAR14_G8_SEL" width="20" begin="19" end="0" resetval="0x0" description="Corresponding INT XBAR G8 Input Select0:CMP12SSA0.CTRIPL1:CMP12SSA0.CTRIPH2:CMP12SSA1.CTRIPL3:CMP12SSA1.CTRIPH4:CMP12SSA2.CTRIPL5:CMP12SSA2.CTRIPH6:CMP12SSA3.CTRIPL7:CMP12SSA3.CTRIPH8:CMP12SSA4.CTRIPL9:CMP12SSA4.CTRIPH10:CMP12SSA5.CTRIPL11:CMP12SSA5.CTRIPH12:CMP12SSA6.CTRIPL13:CMP12SSA6.CTRIPH14:CMP12SSA7.CTRIPL15:CMP12SSA7.CTRIPH16:CMP12SSA8.CTRIPL17:CMP12SSA8.CTRIPH18:CMP12SSA9.CTRIPL19:CMP12SSA9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR14_G9" acronym="CONTROLSS_INTXBAR14_G9" offset="1188" width="32" description="INT XBAR 14 Input Select.">
		<bitfield id="INTXBAR14_G9_SEL" width="20" begin="19" end="0" resetval="0x0" description="Corresponding INT XBAR G9 Input Select0:CMP12SSB0.CTRIPL1:CMP12SSB0.CTRIPH2:CMP12SSB1.CTRIPL3:CMP12SSB1.CTRIPH4:CMP12SSB2.CTRIPL5:CMP12SSB2.CTRIPH6:CMP12SSB3.CTRIPL7:CMP12SSB3.CTRIPH8:CMP12SSB4.CTRIPL9:CMP12SSB4.CTRIPH10:CMP12SSB5.CTRIPL11:CMP12SSB5.CTRIPH12:CMP12SSB6.CTRIPL13:CMP12SSB6.CTRIPH14:CMP12SSB7.CTRIPL15:CMP12SSB7.CTRIPH16:CMP12SSB8.CTRIPL17:CMP12SSB8.CTRIPH18:CMP12SSB9.CTRIPL19:CMP12SSB9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR15_G0" acronym="CONTROLSS_INTXBAR15_G0" offset="1216" width="32" description="INT XBAR 15 Input Select.">
		<bitfield id="INTXBAR15_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM INT interrupt to corresponding XBAR1:PWMx.INT is selected0:PWMx.INT is de-selected x can have value from  0 to 31 corresponding to each PWM instance" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR15_G1" acronym="CONTROLSS_INTXBAR15_G1" offset="1220" width="32" description="INT XBAR 15 Input Select.">
		<bitfield id="INTXBAR15_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM TZINT interrupt to corresponding XBAR1:PWMx.TZINT is selected0:PWMx.TZINT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR15_G2" acronym="CONTROLSS_INTXBAR15_G2" offset="1224" width="32" description="INT XBAR 15 Input Select.">
		<bitfield id="INTXBAR15_G2_SEL" width="32" begin="31" end="0" resetval="0x0" description="Corresponding INT XBAR G2 Input SelectBit0:ADC0.INT1Bit1:ADC0.INT2Bit2:ADC0.INT3Bit3:ADC0.INT4Bit4:ADC0.EVTINTBit5:ADC1.INT1Bit6:ADC1.INT2Bit7:ADC1.INT3Bit8:ADC1.INT4Bit9:ADC1.EVTINTBit10:ADC2.INT1Bit11:ADC2.INT2Bit12:ADC2.INT3Bit13:ADC2.INT4Bit14:ADC2.EVTINTBit15:ADC3.INT1Bit16:ADC3.INT2Bit17:ADC3.INT3Bit18:ADC3.INT4Bit19:ADC3.EVTINTBit20:ADC4.INT1Bit21:ADC4.INT2Bit22:ADC4.INT3Bit23:ADC4.INT4Bit24:ADC4.EVTINTBit 2530:ReservedBit31:ASC_AGG0.INT" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR15_G3" acronym="CONTROLSS_INTXBAR15_G3" offset="1228" width="32" description="INT XBAR 15 Input Select.">
		<bitfield id="INTXBAR15_G3_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G3 Input Select0:FSIRX0.INT1N1:FSIRX0.INT2N2:FSIRX1.INT1N3:FSIRX1.INT2N4:FSIRX2.INT1N5:FSIRX2.INT2N6:FSIRX3.INT1N7:FSIRX3.INT2N8:FSITX0.INT1N9:FSITX0.INT2N10:FSITX1.INT1N11:FSITX1.INT2N12:FSITX2.INT1N13:FSITX2.INT2N14:FSITX3.INT1N15:FSITX3.INT2N" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR15_G4" acronym="CONTROLSS_INTXBAR15_G4" offset="1232" width="32" description="INT XBAR 15 Input Select.">
		<bitfield id="INTXBAR15_G4_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G4 Input Select0:SD0.ERR1:SD0.FILT1.DRINT2:SD0.FILT2.DRINT3:SD0.FILT3.DRINT4:SD0.FILT4.DRINT5:SD1.ERR6:SD1.FILT1.DRINT7:SD1.FILT2.DRINT8:SD1.FILT3.DRINT9:SD1.FILT4.DRINT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR15_G5" acronym="CONTROLSS_INTXBAR15_G5" offset="1236" width="32" description="INT XBAR 15 Input Select.">
		<bitfield id="INTXBAR15_G5_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G5 Input Select0:ECAP0.INT1:ECAP1.INT2:ECAP2.INT3:ECAP3.INT4:ECAP4.INT5:ECAP5.INT6:ECAP6.INT7:ECAP7.INT8:ECAP8.INT9:ECAP9.INT10:ECAP10.INT11:ECAP11.INT12:ECAP12.INT13:ECAP13.INT14:ECAP14.INT15:ECAP15.INT" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR15_G6" acronym="CONTROLSS_INTXBAR15_G6" offset="1240" width="32" description="INT XBAR 15 Input Select.">
		<bitfield id="INTXBAR15_G6_SEL" width="3" begin="2" end="0" resetval="0x0" description="Corresponding INT XBAR G6 Input Select0:EQEP0.INT1:EQEP1.INT2:EQEP2.INT" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR15_G7" acronym="CONTROLSS_INTXBAR15_G7" offset="1244" width="32" description="INT XBAR 15 Input Select.">
		<bitfield id="INTXBAR15_G7_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G7 Input SelectBit0:ADCR0.INT1Bit1:ADCR0.INT2Bit2:ADCR0.INT3Bit3:ADCR0.INT4Bit4:ADCR0.EVTINTBit5:ADCR1.INT1Bit6:ADCR1.INT2Bit7:ADCR1.INT3Bit8:ADCR1.INT4Bit9:ADCR1.EVTINTBit 1031:Reserved" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR15_G8" acronym="CONTROLSS_INTXBAR15_G8" offset="1248" width="32" description="INT XBAR 15 Input Select.">
		<bitfield id="INTXBAR15_G8_SEL" width="20" begin="19" end="0" resetval="0x0" description="Corresponding INT XBAR G8 Input Select0:CMP12SSA0.CTRIPL1:CMP12SSA0.CTRIPH2:CMP12SSA1.CTRIPL3:CMP12SSA1.CTRIPH4:CMP12SSA2.CTRIPL5:CMP12SSA2.CTRIPH6:CMP12SSA3.CTRIPL7:CMP12SSA3.CTRIPH8:CMP12SSA4.CTRIPL9:CMP12SSA4.CTRIPH10:CMP12SSA5.CTRIPL11:CMP12SSA5.CTRIPH12:CMP12SSA6.CTRIPL13:CMP12SSA6.CTRIPH14:CMP12SSA7.CTRIPL15:CMP12SSA7.CTRIPH16:CMP12SSA8.CTRIPL17:CMP12SSA8.CTRIPH18:CMP12SSA9.CTRIPL19:CMP12SSA9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR15_G9" acronym="CONTROLSS_INTXBAR15_G9" offset="1252" width="32" description="INT XBAR 15 Input Select.">
		<bitfield id="INTXBAR15_G9_SEL" width="20" begin="19" end="0" resetval="0x0" description="Corresponding INT XBAR G9 Input Select0:CMP12SSB0.CTRIPL1:CMP12SSB0.CTRIPH2:CMP12SSB1.CTRIPL3:CMP12SSB1.CTRIPH4:CMP12SSB2.CTRIPL5:CMP12SSB2.CTRIPH6:CMP12SSB3.CTRIPL7:CMP12SSB3.CTRIPH8:CMP12SSB4.CTRIPL9:CMP12SSB4.CTRIPH10:CMP12SSB5.CTRIPL11:CMP12SSB5.CTRIPH12:CMP12SSB6.CTRIPL13:CMP12SSB6.CTRIPH14:CMP12SSB7.CTRIPL15:CMP12SSB7.CTRIPH16:CMP12SSB8.CTRIPL17:CMP12SSB8.CTRIPH18:CMP12SSB9.CTRIPL19:CMP12SSB9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR16_G0" acronym="CONTROLSS_INTXBAR16_G0" offset="1280" width="32" description="INT XBAR 16 Input Select.">
		<bitfield id="INTXBAR16_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM INT interrupt to corresponding XBAR1:PWMx.INT is selected0:PWMx.INT is de-selected x can have value from  0 to 31 corresponding to each PWM instance" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR16_G1" acronym="CONTROLSS_INTXBAR16_G1" offset="1284" width="32" description="INT XBAR 16 Input Select.">
		<bitfield id="INTXBAR16_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM TZINT interrupt to corresponding XBAR1:PWMx.TZINT is selected0:PWMx.TZINT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR16_G2" acronym="CONTROLSS_INTXBAR16_G2" offset="1288" width="32" description="INT XBAR 16 Input Select.">
		<bitfield id="INTXBAR16_G2_SEL" width="32" begin="31" end="0" resetval="0x0" description="Corresponding INT XBAR G2 Input SelectBit0:ADC0.INT1Bit1:ADC0.INT2Bit2:ADC0.INT3Bit3:ADC0.INT4Bit4:ADC0.EVTINTBit5:ADC1.INT1Bit6:ADC1.INT2Bit7:ADC1.INT3Bit8:ADC1.INT4Bit9:ADC1.EVTINTBit10:ADC2.INT1Bit11:ADC2.INT2Bit12:ADC2.INT3Bit13:ADC2.INT4Bit14:ADC2.EVTINTBit15:ADC3.INT1Bit16:ADC3.INT2Bit17:ADC3.INT3Bit18:ADC3.INT4Bit19:ADC3.EVTINTBit20:ADC4.INT1Bit21:ADC4.INT2Bit22:ADC4.INT3Bit23:ADC4.INT4Bit24:ADC4.EVTINTBit 2530:ReservedBit31:ASC_AGG0.INT" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR16_G3" acronym="CONTROLSS_INTXBAR16_G3" offset="1292" width="32" description="INT XBAR 16 Input Select.">
		<bitfield id="INTXBAR16_G3_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G3 Input Select0:FSIRX0.INT1N1:FSIRX0.INT2N2:FSIRX1.INT1N3:FSIRX1.INT2N4:FSIRX2.INT1N5:FSIRX2.INT2N6:FSIRX3.INT1N7:FSIRX3.INT2N8:FSITX0.INT1N9:FSITX0.INT2N10:FSITX1.INT1N11:FSITX1.INT2N12:FSITX2.INT1N13:FSITX2.INT2N14:FSITX3.INT1N15:FSITX3.INT2N" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR16_G4" acronym="CONTROLSS_INTXBAR16_G4" offset="1296" width="32" description="INT XBAR 16 Input Select.">
		<bitfield id="INTXBAR16_G4_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G4 Input Select0:SD0.ERR1:SD0.FILT1.DRINT2:SD0.FILT2.DRINT3:SD0.FILT3.DRINT4:SD0.FILT4.DRINT5:SD1.ERR6:SD1.FILT1.DRINT7:SD1.FILT2.DRINT8:SD1.FILT3.DRINT9:SD1.FILT4.DRINT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR16_G5" acronym="CONTROLSS_INTXBAR16_G5" offset="1300" width="32" description="INT XBAR 16 Input Select.">
		<bitfield id="INTXBAR16_G5_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G5 Input Select0:ECAP0.INT1:ECAP1.INT2:ECAP2.INT3:ECAP3.INT4:ECAP4.INT5:ECAP5.INT6:ECAP6.INT7:ECAP7.INT8:ECAP8.INT9:ECAP9.INT10:ECAP10.INT11:ECAP11.INT12:ECAP12.INT13:ECAP13.INT14:ECAP14.INT15:ECAP15.INT" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR16_G6" acronym="CONTROLSS_INTXBAR16_G6" offset="1304" width="32" description="INT XBAR 16 Input Select.">
		<bitfield id="INTXBAR16_G6_SEL" width="3" begin="2" end="0" resetval="0x0" description="Corresponding INT XBAR G6 Input Select0:EQEP0.INT1:EQEP1.INT2:EQEP2.INT" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR16_G7" acronym="CONTROLSS_INTXBAR16_G7" offset="1308" width="32" description="INT XBAR 16 Input Select.">
		<bitfield id="INTXBAR16_G7_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G7 Input SelectBit0:ADCR0.INT1Bit1:ADCR0.INT2Bit2:ADCR0.INT3Bit3:ADCR0.INT4Bit4:ADCR0.EVTINTBit5:ADCR1.INT1Bit6:ADCR1.INT2Bit7:ADCR1.INT3Bit8:ADCR1.INT4Bit9:ADCR1.EVTINTBit 1031:Reserved" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR16_G8" acronym="CONTROLSS_INTXBAR16_G8" offset="1312" width="32" description="INT XBAR 16 Input Select.">
		<bitfield id="INTXBAR16_G8_SEL" width="20" begin="19" end="0" resetval="0x0" description="Corresponding INT XBAR G8 Input Select0:CMP12SSA0.CTRIPL1:CMP12SSA0.CTRIPH2:CMP12SSA1.CTRIPL3:CMP12SSA1.CTRIPH4:CMP12SSA2.CTRIPL5:CMP12SSA2.CTRIPH6:CMP12SSA3.CTRIPL7:CMP12SSA3.CTRIPH8:CMP12SSA4.CTRIPL9:CMP12SSA4.CTRIPH10:CMP12SSA5.CTRIPL11:CMP12SSA5.CTRIPH12:CMP12SSA6.CTRIPL13:CMP12SSA6.CTRIPH14:CMP12SSA7.CTRIPL15:CMP12SSA7.CTRIPH16:CMP12SSA8.CTRIPL17:CMP12SSA8.CTRIPH18:CMP12SSA9.CTRIPL19:CMP12SSA9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR16_G9" acronym="CONTROLSS_INTXBAR16_G9" offset="1316" width="32" description="INT XBAR 16 Input Select.">
		<bitfield id="INTXBAR16_G9_SEL" width="20" begin="19" end="0" resetval="0x0" description="Corresponding INT XBAR G9 Input Select0:CMP12SSB0.CTRIPL1:CMP12SSB0.CTRIPH2:CMP12SSB1.CTRIPL3:CMP12SSB1.CTRIPH4:CMP12SSB2.CTRIPL5:CMP12SSB2.CTRIPH6:CMP12SSB3.CTRIPL7:CMP12SSB3.CTRIPH8:CMP12SSB4.CTRIPL9:CMP12SSB4.CTRIPH10:CMP12SSB5.CTRIPL11:CMP12SSB5.CTRIPH12:CMP12SSB6.CTRIPL13:CMP12SSB6.CTRIPH14:CMP12SSB7.CTRIPL15:CMP12SSB7.CTRIPH16:CMP12SSB8.CTRIPL17:CMP12SSB8.CTRIPH18:CMP12SSB9.CTRIPL19:CMP12SSB9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR17_G0" acronym="CONTROLSS_INTXBAR17_G0" offset="1344" width="32" description="INT XBAR 17 Input Select.">
		<bitfield id="INTXBAR17_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM INT interrupt to corresponding XBAR1:PWMx.INT is selected0:PWMx.INT is de-selected x can have value from  0 to 31 corresponding to each PWM instance" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR17_G1" acronym="CONTROLSS_INTXBAR17_G1" offset="1348" width="32" description="INT XBAR 17 Input Select.">
		<bitfield id="INTXBAR17_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM TZINT interrupt to corresponding XBAR1:PWMx.TZINT is selected0:PWMx.TZINT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR17_G2" acronym="CONTROLSS_INTXBAR17_G2" offset="1352" width="32" description="INT XBAR 17 Input Select.">
		<bitfield id="INTXBAR17_G2_SEL" width="32" begin="31" end="0" resetval="0x0" description="Corresponding INT XBAR G2 Input SelectBit0:ADC0.INT1Bit1:ADC0.INT2Bit2:ADC0.INT3Bit3:ADC0.INT4Bit4:ADC0.EVTINTBit5:ADC1.INT1Bit6:ADC1.INT2Bit7:ADC1.INT3Bit8:ADC1.INT4Bit9:ADC1.EVTINTBit10:ADC2.INT1Bit11:ADC2.INT2Bit12:ADC2.INT3Bit13:ADC2.INT4Bit14:ADC2.EVTINTBit15:ADC3.INT1Bit16:ADC3.INT2Bit17:ADC3.INT3Bit18:ADC3.INT4Bit19:ADC3.EVTINTBit20:ADC4.INT1Bit21:ADC4.INT2Bit22:ADC4.INT3Bit23:ADC4.INT4Bit24:ADC4.EVTINTBit 2530:ReservedBit31:ASC_AGG0.INT" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR17_G3" acronym="CONTROLSS_INTXBAR17_G3" offset="1356" width="32" description="INT XBAR 17 Input Select.">
		<bitfield id="INTXBAR17_G3_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G3 Input Select0:FSIRX0.INT1N1:FSIRX0.INT2N2:FSIRX1.INT1N3:FSIRX1.INT2N4:FSIRX2.INT1N5:FSIRX2.INT2N6:FSIRX3.INT1N7:FSIRX3.INT2N8:FSITX0.INT1N9:FSITX0.INT2N10:FSITX1.INT1N11:FSITX1.INT2N12:FSITX2.INT1N13:FSITX2.INT2N14:FSITX3.INT1N15:FSITX3.INT2N" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR17_G4" acronym="CONTROLSS_INTXBAR17_G4" offset="1360" width="32" description="INT XBAR 17 Input Select.">
		<bitfield id="INTXBAR17_G4_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G4 Input Select0:SD0.ERR1:SD0.FILT1.DRINT2:SD0.FILT2.DRINT3:SD0.FILT3.DRINT4:SD0.FILT4.DRINT5:SD1.ERR6:SD1.FILT1.DRINT7:SD1.FILT2.DRINT8:SD1.FILT3.DRINT9:SD1.FILT4.DRINT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR17_G5" acronym="CONTROLSS_INTXBAR17_G5" offset="1364" width="32" description="INT XBAR 17 Input Select.">
		<bitfield id="INTXBAR17_G5_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G5 Input Select0:ECAP0.INT1:ECAP1.INT2:ECAP2.INT3:ECAP3.INT4:ECAP4.INT5:ECAP5.INT6:ECAP6.INT7:ECAP7.INT8:ECAP8.INT9:ECAP9.INT10:ECAP10.INT11:ECAP11.INT12:ECAP12.INT13:ECAP13.INT14:ECAP14.INT15:ECAP15.INT" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR17_G6" acronym="CONTROLSS_INTXBAR17_G6" offset="1368" width="32" description="INT XBAR 17 Input Select.">
		<bitfield id="INTXBAR17_G6_SEL" width="3" begin="2" end="0" resetval="0x0" description="Corresponding INT XBAR G6 Input Select0:EQEP0.INT1:EQEP1.INT2:EQEP2.INT" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR17_G7" acronym="CONTROLSS_INTXBAR17_G7" offset="1372" width="32" description="INT XBAR 17 Input Select.">
		<bitfield id="INTXBAR17_G7_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G7 Input SelectBit0:ADCR0.INT1Bit1:ADCR0.INT2Bit2:ADCR0.INT3Bit3:ADCR0.INT4Bit4:ADCR0.EVTINTBit5:ADCR1.INT1Bit6:ADCR1.INT2Bit7:ADCR1.INT3Bit8:ADCR1.INT4Bit9:ADCR1.EVTINTBit 1031:Reserved" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR17_G8" acronym="CONTROLSS_INTXBAR17_G8" offset="1376" width="32" description="INT XBAR 17 Input Select.">
		<bitfield id="INTXBAR17_G8_SEL" width="20" begin="19" end="0" resetval="0x0" description="Corresponding INT XBAR G8 Input Select0:CMP12SSA0.CTRIPL1:CMP12SSA0.CTRIPH2:CMP12SSA1.CTRIPL3:CMP12SSA1.CTRIPH4:CMP12SSA2.CTRIPL5:CMP12SSA2.CTRIPH6:CMP12SSA3.CTRIPL7:CMP12SSA3.CTRIPH8:CMP12SSA4.CTRIPL9:CMP12SSA4.CTRIPH10:CMP12SSA5.CTRIPL11:CMP12SSA5.CTRIPH12:CMP12SSA6.CTRIPL13:CMP12SSA6.CTRIPH14:CMP12SSA7.CTRIPL15:CMP12SSA7.CTRIPH16:CMP12SSA8.CTRIPL17:CMP12SSA8.CTRIPH18:CMP12SSA9.CTRIPL19:CMP12SSA9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR17_G9" acronym="CONTROLSS_INTXBAR17_G9" offset="1380" width="32" description="INT XBAR 17 Input Select.">
		<bitfield id="INTXBAR17_G9_SEL" width="20" begin="19" end="0" resetval="0x0" description="Corresponding INT XBAR G9 Input Select0:CMP12SSB0.CTRIPL1:CMP12SSB0.CTRIPH2:CMP12SSB1.CTRIPL3:CMP12SSB1.CTRIPH4:CMP12SSB2.CTRIPL5:CMP12SSB2.CTRIPH6:CMP12SSB3.CTRIPL7:CMP12SSB3.CTRIPH8:CMP12SSB4.CTRIPL9:CMP12SSB4.CTRIPH10:CMP12SSB5.CTRIPL11:CMP12SSB5.CTRIPH12:CMP12SSB6.CTRIPL13:CMP12SSB6.CTRIPH14:CMP12SSB7.CTRIPL15:CMP12SSB7.CTRIPH16:CMP12SSB8.CTRIPL17:CMP12SSB8.CTRIPH18:CMP12SSB9.CTRIPL19:CMP12SSB9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR18_G0" acronym="CONTROLSS_INTXBAR18_G0" offset="1408" width="32" description="INT XBAR 18 Input Select.">
		<bitfield id="INTXBAR18_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM INT interrupt to corresponding XBAR1:PWMx.INT is selected0:PWMx.INT is de-selected x can have value from  0 to 31 corresponding to each PWM instance" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR18_G1" acronym="CONTROLSS_INTXBAR18_G1" offset="1412" width="32" description="INT XBAR 18 Input Select.">
		<bitfield id="INTXBAR18_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM TZINT interrupt to corresponding XBAR1:PWMx.TZINT is selected0:PWMx.TZINT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR18_G2" acronym="CONTROLSS_INTXBAR18_G2" offset="1416" width="32" description="INT XBAR 18 Input Select.">
		<bitfield id="INTXBAR18_G2_SEL" width="32" begin="31" end="0" resetval="0x0" description="Corresponding INT XBAR G2 Input SelectBit0:ADC0.INT1Bit1:ADC0.INT2Bit2:ADC0.INT3Bit3:ADC0.INT4Bit4:ADC0.EVTINTBit5:ADC1.INT1Bit6:ADC1.INT2Bit7:ADC1.INT3Bit8:ADC1.INT4Bit9:ADC1.EVTINTBit10:ADC2.INT1Bit11:ADC2.INT2Bit12:ADC2.INT3Bit13:ADC2.INT4Bit14:ADC2.EVTINTBit15:ADC3.INT1Bit16:ADC3.INT2Bit17:ADC3.INT3Bit18:ADC3.INT4Bit19:ADC3.EVTINTBit20:ADC4.INT1Bit21:ADC4.INT2Bit22:ADC4.INT3Bit23:ADC4.INT4Bit24:ADC4.EVTINTBit 2530:ReservedBit31:ASC_AGG0.INT" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR18_G3" acronym="CONTROLSS_INTXBAR18_G3" offset="1420" width="32" description="INT XBAR 18 Input Select.">
		<bitfield id="INTXBAR18_G3_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G3 Input Select0:FSIRX0.INT1N1:FSIRX0.INT2N2:FSIRX1.INT1N3:FSIRX1.INT2N4:FSIRX2.INT1N5:FSIRX2.INT2N6:FSIRX3.INT1N7:FSIRX3.INT2N8:FSITX0.INT1N9:FSITX0.INT2N10:FSITX1.INT1N11:FSITX1.INT2N12:FSITX2.INT1N13:FSITX2.INT2N14:FSITX3.INT1N15:FSITX3.INT2N" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR18_G4" acronym="CONTROLSS_INTXBAR18_G4" offset="1424" width="32" description="INT XBAR 18 Input Select.">
		<bitfield id="INTXBAR18_G4_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G4 Input Select0:SD0.ERR1:SD0.FILT1.DRINT2:SD0.FILT2.DRINT3:SD0.FILT3.DRINT4:SD0.FILT4.DRINT5:SD1.ERR6:SD1.FILT1.DRINT7:SD1.FILT2.DRINT8:SD1.FILT3.DRINT9:SD1.FILT4.DRINT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR18_G5" acronym="CONTROLSS_INTXBAR18_G5" offset="1428" width="32" description="INT XBAR 18 Input Select.">
