ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263P/CONTROLSS_INTXBAR_CONTROLSS_502D5000h.xml
		<bitfield id="INTXBAR18_G5_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G5 Input Select0:ECAP0.INT1:ECAP1.INT2:ECAP2.INT3:ECAP3.INT4:ECAP4.INT5:ECAP5.INT6:ECAP6.INT7:ECAP7.INT8:ECAP8.INT9:ECAP9.INT10:ECAP10.INT11:ECAP11.INT12:ECAP12.INT13:ECAP13.INT14:ECAP14.INT15:ECAP15.INT" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR18_G6" acronym="CONTROLSS_INTXBAR18_G6" offset="1432" width="32" description="INT XBAR 18 Input Select.">
		<bitfield id="INTXBAR18_G6_SEL" width="3" begin="2" end="0" resetval="0x0" description="Corresponding INT XBAR G6 Input Select0:EQEP0.INT1:EQEP1.INT2:EQEP2.INT" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR18_G7" acronym="CONTROLSS_INTXBAR18_G7" offset="1436" width="32" description="INT XBAR 18 Input Select.">
		<bitfield id="INTXBAR18_G7_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G7 Input SelectBit0:ADCR0.INT1Bit1:ADCR0.INT2Bit2:ADCR0.INT3Bit3:ADCR0.INT4Bit4:ADCR0.EVTINTBit5:ADCR1.INT1Bit6:ADCR1.INT2Bit7:ADCR1.INT3Bit8:ADCR1.INT4Bit9:ADCR1.EVTINTBit 1031:Reserved" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR18_G8" acronym="CONTROLSS_INTXBAR18_G8" offset="1440" width="32" description="INT XBAR 18 Input Select.">
		<bitfield id="INTXBAR18_G8_SEL" width="20" begin="19" end="0" resetval="0x0" description="Corresponding INT XBAR G8 Input Select0:CMP12SSA0.CTRIPL1:CMP12SSA0.CTRIPH2:CMP12SSA1.CTRIPL3:CMP12SSA1.CTRIPH4:CMP12SSA2.CTRIPL5:CMP12SSA2.CTRIPH6:CMP12SSA3.CTRIPL7:CMP12SSA3.CTRIPH8:CMP12SSA4.CTRIPL9:CMP12SSA4.CTRIPH10:CMP12SSA5.CTRIPL11:CMP12SSA5.CTRIPH12:CMP12SSA6.CTRIPL13:CMP12SSA6.CTRIPH14:CMP12SSA7.CTRIPL15:CMP12SSA7.CTRIPH16:CMP12SSA8.CTRIPL17:CMP12SSA8.CTRIPH18:CMP12SSA9.CTRIPL19:CMP12SSA9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR18_G9" acronym="CONTROLSS_INTXBAR18_G9" offset="1444" width="32" description="INT XBAR 18 Input Select.">
		<bitfield id="INTXBAR18_G9_SEL" width="20" begin="19" end="0" resetval="0x0" description="Corresponding INT XBAR G9 Input Select0:CMP12SSB0.CTRIPL1:CMP12SSB0.CTRIPH2:CMP12SSB1.CTRIPL3:CMP12SSB1.CTRIPH4:CMP12SSB2.CTRIPL5:CMP12SSB2.CTRIPH6:CMP12SSB3.CTRIPL7:CMP12SSB3.CTRIPH8:CMP12SSB4.CTRIPL9:CMP12SSB4.CTRIPH10:CMP12SSB5.CTRIPL11:CMP12SSB5.CTRIPH12:CMP12SSB6.CTRIPL13:CMP12SSB6.CTRIPH14:CMP12SSB7.CTRIPL15:CMP12SSB7.CTRIPH16:CMP12SSB8.CTRIPL17:CMP12SSB8.CTRIPH18:CMP12SSB9.CTRIPL19:CMP12SSB9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR19_G0" acronym="CONTROLSS_INTXBAR19_G0" offset="1472" width="32" description="INT XBAR 19 Input Select.">
		<bitfield id="INTXBAR19_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM INT interrupt to corresponding XBAR1:PWMx.INT is selected0:PWMx.INT is de-selected x can have value from  0 to 31 corresponding to each PWM instance" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR19_G1" acronym="CONTROLSS_INTXBAR19_G1" offset="1476" width="32" description="INT XBAR 19 Input Select.">
		<bitfield id="INTXBAR19_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM TZINT interrupt to corresponding XBAR1:PWMx.TZINT is selected0:PWMx.TZINT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR19_G2" acronym="CONTROLSS_INTXBAR19_G2" offset="1480" width="32" description="INT XBAR 19 Input Select.">
		<bitfield id="INTXBAR19_G2_SEL" width="32" begin="31" end="0" resetval="0x0" description="Corresponding INT XBAR G2 Input SelectBit0:ADC0.INT1Bit1:ADC0.INT2Bit2:ADC0.INT3Bit3:ADC0.INT4Bit4:ADC0.EVTINTBit5:ADC1.INT1Bit6:ADC1.INT2Bit7:ADC1.INT3Bit8:ADC1.INT4Bit9:ADC1.EVTINTBit10:ADC2.INT1Bit11:ADC2.INT2Bit12:ADC2.INT3Bit13:ADC2.INT4Bit14:ADC2.EVTINTBit15:ADC3.INT1Bit16:ADC3.INT2Bit17:ADC3.INT3Bit18:ADC3.INT4Bit19:ADC3.EVTINTBit20:ADC4.INT1Bit21:ADC4.INT2Bit22:ADC4.INT3Bit23:ADC4.INT4Bit24:ADC4.EVTINTBit 2530:ReservedBit31:ASC_AGG0.INT" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR19_G3" acronym="CONTROLSS_INTXBAR19_G3" offset="1484" width="32" description="INT XBAR 19 Input Select.">
		<bitfield id="INTXBAR19_G3_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G3 Input Select0:FSIRX0.INT1N1:FSIRX0.INT2N2:FSIRX1.INT1N3:FSIRX1.INT2N4:FSIRX2.INT1N5:FSIRX2.INT2N6:FSIRX3.INT1N7:FSIRX3.INT2N8:FSITX0.INT1N9:FSITX0.INT2N10:FSITX1.INT1N11:FSITX1.INT2N12:FSITX2.INT1N13:FSITX2.INT2N14:FSITX3.INT1N15:FSITX3.INT2N" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR19_G4" acronym="CONTROLSS_INTXBAR19_G4" offset="1488" width="32" description="INT XBAR 19 Input Select.">
		<bitfield id="INTXBAR19_G4_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G4 Input Select0:SD0.ERR1:SD0.FILT1.DRINT2:SD0.FILT2.DRINT3:SD0.FILT3.DRINT4:SD0.FILT4.DRINT5:SD1.ERR6:SD1.FILT1.DRINT7:SD1.FILT2.DRINT8:SD1.FILT3.DRINT9:SD1.FILT4.DRINT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR19_G5" acronym="CONTROLSS_INTXBAR19_G5" offset="1492" width="32" description="INT XBAR 19 Input Select.">
		<bitfield id="INTXBAR19_G5_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G5 Input Select0:ECAP0.INT1:ECAP1.INT2:ECAP2.INT3:ECAP3.INT4:ECAP4.INT5:ECAP5.INT6:ECAP6.INT7:ECAP7.INT8:ECAP8.INT9:ECAP9.INT10:ECAP10.INT11:ECAP11.INT12:ECAP12.INT13:ECAP13.INT14:ECAP14.INT15:ECAP15.INT" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR19_G6" acronym="CONTROLSS_INTXBAR19_G6" offset="1496" width="32" description="INT XBAR 19 Input Select.">
		<bitfield id="INTXBAR19_G6_SEL" width="3" begin="2" end="0" resetval="0x0" description="Corresponding INT XBAR G6 Input Select0:EQEP0.INT1:EQEP1.INT2:EQEP2.INT" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR19_G7" acronym="CONTROLSS_INTXBAR19_G7" offset="1500" width="32" description="INT XBAR 19 Input Select.">
		<bitfield id="INTXBAR19_G7_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G7 Input SelectBit0:ADCR0.INT1Bit1:ADCR0.INT2Bit2:ADCR0.INT3Bit3:ADCR0.INT4Bit4:ADCR0.EVTINTBit5:ADCR1.INT1Bit6:ADCR1.INT2Bit7:ADCR1.INT3Bit8:ADCR1.INT4Bit9:ADCR1.EVTINTBit 1031:Reserved" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR19_G8" acronym="CONTROLSS_INTXBAR19_G8" offset="1504" width="32" description="INT XBAR 19 Input Select.">
		<bitfield id="INTXBAR19_G8_SEL" width="20" begin="19" end="0" resetval="0x0" description="Corresponding INT XBAR G8 Input Select0:CMP12SSA0.CTRIPL1:CMP12SSA0.CTRIPH2:CMP12SSA1.CTRIPL3:CMP12SSA1.CTRIPH4:CMP12SSA2.CTRIPL5:CMP12SSA2.CTRIPH6:CMP12SSA3.CTRIPL7:CMP12SSA3.CTRIPH8:CMP12SSA4.CTRIPL9:CMP12SSA4.CTRIPH10:CMP12SSA5.CTRIPL11:CMP12SSA5.CTRIPH12:CMP12SSA6.CTRIPL13:CMP12SSA6.CTRIPH14:CMP12SSA7.CTRIPL15:CMP12SSA7.CTRIPH16:CMP12SSA8.CTRIPL17:CMP12SSA8.CTRIPH18:CMP12SSA9.CTRIPL19:CMP12SSA9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR19_G9" acronym="CONTROLSS_INTXBAR19_G9" offset="1508" width="32" description="INT XBAR 19 Input Select.">
		<bitfield id="INTXBAR19_G9_SEL" width="20" begin="19" end="0" resetval="0x0" description="Corresponding INT XBAR G9 Input Select0:CMP12SSB0.CTRIPL1:CMP12SSB0.CTRIPH2:CMP12SSB1.CTRIPL3:CMP12SSB1.CTRIPH4:CMP12SSB2.CTRIPL5:CMP12SSB2.CTRIPH6:CMP12SSB3.CTRIPL7:CMP12SSB3.CTRIPH8:CMP12SSB4.CTRIPL9:CMP12SSB4.CTRIPH10:CMP12SSB5.CTRIPL11:CMP12SSB5.CTRIPH12:CMP12SSB6.CTRIPL13:CMP12SSB6.CTRIPH14:CMP12SSB7.CTRIPL15:CMP12SSB7.CTRIPH16:CMP12SSB8.CTRIPL17:CMP12SSB8.CTRIPH18:CMP12SSB9.CTRIPL19:CMP12SSB9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR20_G0" acronym="CONTROLSS_INTXBAR20_G0" offset="1536" width="32" description="INT XBAR 20 Input Select.">
		<bitfield id="INTXBAR20_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM INT interrupt to corresponding XBAR1:PWMx.INT is selected0:PWMx.INT is de-selected x can have value from  0 to 31 corresponding to each PWM instance" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR20_G1" acronym="CONTROLSS_INTXBAR20_G1" offset="1540" width="32" description="INT XBAR 20 Input Select.">
		<bitfield id="INTXBAR20_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM TZINT interrupt to corresponding XBAR1:PWMx.TZINT is selected0:PWMx.TZINT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR20_G2" acronym="CONTROLSS_INTXBAR20_G2" offset="1544" width="32" description="INT XBAR 20 Input Select.">
		<bitfield id="INTXBAR20_G2_SEL" width="32" begin="31" end="0" resetval="0x0" description="Corresponding INT XBAR G2 Input SelectBit0:ADC0.INT1Bit1:ADC0.INT2Bit2:ADC0.INT3Bit3:ADC0.INT4Bit4:ADC0.EVTINTBit5:ADC1.INT1Bit6:ADC1.INT2Bit7:ADC1.INT3Bit8:ADC1.INT4Bit9:ADC1.EVTINTBit10:ADC2.INT1Bit11:ADC2.INT2Bit12:ADC2.INT3Bit13:ADC2.INT4Bit14:ADC2.EVTINTBit15:ADC3.INT1Bit16:ADC3.INT2Bit17:ADC3.INT3Bit18:ADC3.INT4Bit19:ADC3.EVTINTBit20:ADC4.INT1Bit21:ADC4.INT2Bit22:ADC4.INT3Bit23:ADC4.INT4Bit24:ADC4.EVTINTBit 2530:ReservedBit31:ASC_AGG0.INT" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR20_G3" acronym="CONTROLSS_INTXBAR20_G3" offset="1548" width="32" description="INT XBAR 20 Input Select.">
		<bitfield id="INTXBAR20_G3_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G3 Input Select0:FSIRX0.INT1N1:FSIRX0.INT2N2:FSIRX1.INT1N3:FSIRX1.INT2N4:FSIRX2.INT1N5:FSIRX2.INT2N6:FSIRX3.INT1N7:FSIRX3.INT2N8:FSITX0.INT1N9:FSITX0.INT2N10:FSITX1.INT1N11:FSITX1.INT2N12:FSITX2.INT1N13:FSITX2.INT2N14:FSITX3.INT1N15:FSITX3.INT2N" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR20_G4" acronym="CONTROLSS_INTXBAR20_G4" offset="1552" width="32" description="INT XBAR 20 Input Select.">
		<bitfield id="INTXBAR20_G4_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G4 Input Select0:SD0.ERR1:SD0.FILT1.DRINT2:SD0.FILT2.DRINT3:SD0.FILT3.DRINT4:SD0.FILT4.DRINT5:SD1.ERR6:SD1.FILT1.DRINT7:SD1.FILT2.DRINT8:SD1.FILT3.DRINT9:SD1.FILT4.DRINT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR20_G5" acronym="CONTROLSS_INTXBAR20_G5" offset="1556" width="32" description="INT XBAR 20 Input Select.">
		<bitfield id="INTXBAR20_G5_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G5 Input Select0:ECAP0.INT1:ECAP1.INT2:ECAP2.INT3:ECAP3.INT4:ECAP4.INT5:ECAP5.INT6:ECAP6.INT7:ECAP7.INT8:ECAP8.INT9:ECAP9.INT10:ECAP10.INT11:ECAP11.INT12:ECAP12.INT13:ECAP13.INT14:ECAP14.INT15:ECAP15.INT" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR20_G6" acronym="CONTROLSS_INTXBAR20_G6" offset="1560" width="32" description="INT XBAR 20 Input Select.">
		<bitfield id="INTXBAR20_G6_SEL" width="3" begin="2" end="0" resetval="0x0" description="Corresponding INT XBAR G6 Input Select0:EQEP0.INT1:EQEP1.INT2:EQEP2.INT" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR20_G7" acronym="CONTROLSS_INTXBAR20_G7" offset="1564" width="32" description="INT XBAR 20 Input Select.">
		<bitfield id="INTXBAR20_G7_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G7 Input SelectBit0:ADCR0.INT1Bit1:ADCR0.INT2Bit2:ADCR0.INT3Bit3:ADCR0.INT4Bit4:ADCR0.EVTINTBit5:ADCR1.INT1Bit6:ADCR1.INT2Bit7:ADCR1.INT3Bit8:ADCR1.INT4Bit9:ADCR1.EVTINTBit 1031:Reserved" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR20_G8" acronym="CONTROLSS_INTXBAR20_G8" offset="1568" width="32" description="INT XBAR 20 Input Select.">
		<bitfield id="INTXBAR20_G8_SEL" width="20" begin="19" end="0" resetval="0x0" description="Corresponding INT XBAR G8 Input Select0:CMP12SSA0.CTRIPL1:CMP12SSA0.CTRIPH2:CMP12SSA1.CTRIPL3:CMP12SSA1.CTRIPH4:CMP12SSA2.CTRIPL5:CMP12SSA2.CTRIPH6:CMP12SSA3.CTRIPL7:CMP12SSA3.CTRIPH8:CMP12SSA4.CTRIPL9:CMP12SSA4.CTRIPH10:CMP12SSA5.CTRIPL11:CMP12SSA5.CTRIPH12:CMP12SSA6.CTRIPL13:CMP12SSA6.CTRIPH14:CMP12SSA7.CTRIPL15:CMP12SSA7.CTRIPH16:CMP12SSA8.CTRIPL17:CMP12SSA8.CTRIPH18:CMP12SSA9.CTRIPL19:CMP12SSA9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR20_G9" acronym="CONTROLSS_INTXBAR20_G9" offset="1572" width="32" description="INT XBAR 20 Input Select.">
		<bitfield id="INTXBAR20_G9_SEL" width="20" begin="19" end="0" resetval="0x0" description="Corresponding INT XBAR G9 Input Select0:CMP12SSB0.CTRIPL1:CMP12SSB0.CTRIPH2:CMP12SSB1.CTRIPL3:CMP12SSB1.CTRIPH4:CMP12SSB2.CTRIPL5:CMP12SSB2.CTRIPH6:CMP12SSB3.CTRIPL7:CMP12SSB3.CTRIPH8:CMP12SSB4.CTRIPL9:CMP12SSB4.CTRIPH10:CMP12SSB5.CTRIPL11:CMP12SSB5.CTRIPH12:CMP12SSB6.CTRIPL13:CMP12SSB6.CTRIPH14:CMP12SSB7.CTRIPL15:CMP12SSB7.CTRIPH16:CMP12SSB8.CTRIPL17:CMP12SSB8.CTRIPH18:CMP12SSB9.CTRIPL19:CMP12SSB9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR21_G0" acronym="CONTROLSS_INTXBAR21_G0" offset="1600" width="32" description="INT XBAR 21 Input Select.">
		<bitfield id="INTXBAR21_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM INT interrupt to corresponding XBAR1:PWMx.INT is selected0:PWMx.INT is de-selected x can have value from  0 to 31 corresponding to each PWM instance" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR21_G1" acronym="CONTROLSS_INTXBAR21_G1" offset="1604" width="32" description="INT XBAR 21 Input Select.">
		<bitfield id="INTXBAR21_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM TZINT interrupt to corresponding XBAR1:PWMx.TZINT is selected0:PWMx.TZINT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR21_G2" acronym="CONTROLSS_INTXBAR21_G2" offset="1608" width="32" description="INT XBAR 21 Input Select.">
		<bitfield id="INTXBAR21_G2_SEL" width="32" begin="31" end="0" resetval="0x0" description="Corresponding INT XBAR G2 Input SelectBit0:ADC0.INT1Bit1:ADC0.INT2Bit2:ADC0.INT3Bit3:ADC0.INT4Bit4:ADC0.EVTINTBit5:ADC1.INT1Bit6:ADC1.INT2Bit7:ADC1.INT3Bit8:ADC1.INT4Bit9:ADC1.EVTINTBit10:ADC2.INT1Bit11:ADC2.INT2Bit12:ADC2.INT3Bit13:ADC2.INT4Bit14:ADC2.EVTINTBit15:ADC3.INT1Bit16:ADC3.INT2Bit17:ADC3.INT3Bit18:ADC3.INT4Bit19:ADC3.EVTINTBit20:ADC4.INT1Bit21:ADC4.INT2Bit22:ADC4.INT3Bit23:ADC4.INT4Bit24:ADC4.EVTINTBit 2530:ReservedBit31:ASC_AGG0.INT" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR21_G3" acronym="CONTROLSS_INTXBAR21_G3" offset="1612" width="32" description="INT XBAR 21 Input Select.">
		<bitfield id="INTXBAR21_G3_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G3 Input Select0:FSIRX0.INT1N1:FSIRX0.INT2N2:FSIRX1.INT1N3:FSIRX1.INT2N4:FSIRX2.INT1N5:FSIRX2.INT2N6:FSIRX3.INT1N7:FSIRX3.INT2N8:FSITX0.INT1N9:FSITX0.INT2N10:FSITX1.INT1N11:FSITX1.INT2N12:FSITX2.INT1N13:FSITX2.INT2N14:FSITX3.INT1N15:FSITX3.INT2N" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR21_G4" acronym="CONTROLSS_INTXBAR21_G4" offset="1616" width="32" description="INT XBAR 21 Input Select.">
		<bitfield id="INTXBAR21_G4_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G4 Input Select0:SD0.ERR1:SD0.FILT1.DRINT2:SD0.FILT2.DRINT3:SD0.FILT3.DRINT4:SD0.FILT4.DRINT5:SD1.ERR6:SD1.FILT1.DRINT7:SD1.FILT2.DRINT8:SD1.FILT3.DRINT9:SD1.FILT4.DRINT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR21_G5" acronym="CONTROLSS_INTXBAR21_G5" offset="1620" width="32" description="INT XBAR 21 Input Select.">
		<bitfield id="INTXBAR21_G5_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G5 Input Select0:ECAP0.INT1:ECAP1.INT2:ECAP2.INT3:ECAP3.INT4:ECAP4.INT5:ECAP5.INT6:ECAP6.INT7:ECAP7.INT8:ECAP8.INT9:ECAP9.INT10:ECAP10.INT11:ECAP11.INT12:ECAP12.INT13:ECAP13.INT14:ECAP14.INT15:ECAP15.INT" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR21_G6" acronym="CONTROLSS_INTXBAR21_G6" offset="1624" width="32" description="INT XBAR 21 Input Select.">
		<bitfield id="INTXBAR21_G6_SEL" width="3" begin="2" end="0" resetval="0x0" description="Corresponding INT XBAR G6 Input Select0:EQEP0.INT1:EQEP1.INT2:EQEP2.INT" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR21_G7" acronym="CONTROLSS_INTXBAR21_G7" offset="1628" width="32" description="INT XBAR 21 Input Select.">
		<bitfield id="INTXBAR21_G7_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G7 Input SelectBit0:ADCR0.INT1Bit1:ADCR0.INT2Bit2:ADCR0.INT3Bit3:ADCR0.INT4Bit4:ADCR0.EVTINTBit5:ADCR1.INT1Bit6:ADCR1.INT2Bit7:ADCR1.INT3Bit8:ADCR1.INT4Bit9:ADCR1.EVTINTBit 1031:Reserved" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR21_G8" acronym="CONTROLSS_INTXBAR21_G8" offset="1632" width="32" description="INT XBAR 21 Input Select.">
		<bitfield id="INTXBAR21_G8_SEL" width="20" begin="19" end="0" resetval="0x0" description="Corresponding INT XBAR G8 Input Select0:CMP12SSA0.CTRIPL1:CMP12SSA0.CTRIPH2:CMP12SSA1.CTRIPL3:CMP12SSA1.CTRIPH4:CMP12SSA2.CTRIPL5:CMP12SSA2.CTRIPH6:CMP12SSA3.CTRIPL7:CMP12SSA3.CTRIPH8:CMP12SSA4.CTRIPL9:CMP12SSA4.CTRIPH10:CMP12SSA5.CTRIPL11:CMP12SSA5.CTRIPH12:CMP12SSA6.CTRIPL13:CMP12SSA6.CTRIPH14:CMP12SSA7.CTRIPL15:CMP12SSA7.CTRIPH16:CMP12SSA8.CTRIPL17:CMP12SSA8.CTRIPH18:CMP12SSA9.CTRIPL19:CMP12SSA9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR21_G9" acronym="CONTROLSS_INTXBAR21_G9" offset="1636" width="32" description="INT XBAR 21 Input Select.">
		<bitfield id="INTXBAR21_G9_SEL" width="20" begin="19" end="0" resetval="0x0" description="Corresponding INT XBAR G9 Input Select0:CMP12SSB0.CTRIPL1:CMP12SSB0.CTRIPH2:CMP12SSB1.CTRIPL3:CMP12SSB1.CTRIPH4:CMP12SSB2.CTRIPL5:CMP12SSB2.CTRIPH6:CMP12SSB3.CTRIPL7:CMP12SSB3.CTRIPH8:CMP12SSB4.CTRIPL9:CMP12SSB4.CTRIPH10:CMP12SSB5.CTRIPL11:CMP12SSB5.CTRIPH12:CMP12SSB6.CTRIPL13:CMP12SSB6.CTRIPH14:CMP12SSB7.CTRIPL15:CMP12SSB7.CTRIPH16:CMP12SSB8.CTRIPL17:CMP12SSB8.CTRIPH18:CMP12SSB9.CTRIPL19:CMP12SSB9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR22_G0" acronym="CONTROLSS_INTXBAR22_G0" offset="1664" width="32" description="INT XBAR 22 Input Select.">
		<bitfield id="INTXBAR22_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM INT interrupt to corresponding XBAR1:PWMx.INT is selected0:PWMx.INT is de-selected x can have value from  0 to 31 corresponding to each PWM instance" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR22_G1" acronym="CONTROLSS_INTXBAR22_G1" offset="1668" width="32" description="INT XBAR 22 Input Select.">
		<bitfield id="INTXBAR22_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM TZINT interrupt to corresponding XBAR1:PWMx.TZINT is selected0:PWMx.TZINT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR22_G2" acronym="CONTROLSS_INTXBAR22_G2" offset="1672" width="32" description="INT XBAR 22 Input Select.">
		<bitfield id="INTXBAR22_G2_SEL" width="32" begin="31" end="0" resetval="0x0" description="Corresponding INT XBAR G2 Input SelectBit0:ADC0.INT1Bit1:ADC0.INT2Bit2:ADC0.INT3Bit3:ADC0.INT4Bit4:ADC0.EVTINTBit5:ADC1.INT1Bit6:ADC1.INT2Bit7:ADC1.INT3Bit8:ADC1.INT4Bit9:ADC1.EVTINTBit10:ADC2.INT1Bit11:ADC2.INT2Bit12:ADC2.INT3Bit13:ADC2.INT4Bit14:ADC2.EVTINTBit15:ADC3.INT1Bit16:ADC3.INT2Bit17:ADC3.INT3Bit18:ADC3.INT4Bit19:ADC3.EVTINTBit20:ADC4.INT1Bit21:ADC4.INT2Bit22:ADC4.INT3Bit23:ADC4.INT4Bit24:ADC4.EVTINTBit 2530:ReservedBit31:ASC_AGG0.INT" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR22_G3" acronym="CONTROLSS_INTXBAR22_G3" offset="1676" width="32" description="INT XBAR 22 Input Select.">
		<bitfield id="INTXBAR22_G3_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G3 Input Select0:FSIRX0.INT1N1:FSIRX0.INT2N2:FSIRX1.INT1N3:FSIRX1.INT2N4:FSIRX2.INT1N5:FSIRX2.INT2N6:FSIRX3.INT1N7:FSIRX3.INT2N8:FSITX0.INT1N9:FSITX0.INT2N10:FSITX1.INT1N11:FSITX1.INT2N12:FSITX2.INT1N13:FSITX2.INT2N14:FSITX3.INT1N15:FSITX3.INT2N" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR22_G4" acronym="CONTROLSS_INTXBAR22_G4" offset="1680" width="32" description="INT XBAR 22 Input Select.">
		<bitfield id="INTXBAR22_G4_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G4 Input Select0:SD0.ERR1:SD0.FILT1.DRINT2:SD0.FILT2.DRINT3:SD0.FILT3.DRINT4:SD0.FILT4.DRINT5:SD1.ERR6:SD1.FILT1.DRINT7:SD1.FILT2.DRINT8:SD1.FILT3.DRINT9:SD1.FILT4.DRINT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR22_G5" acronym="CONTROLSS_INTXBAR22_G5" offset="1684" width="32" description="INT XBAR 22 Input Select.">
		<bitfield id="INTXBAR22_G5_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G5 Input Select0:ECAP0.INT1:ECAP1.INT2:ECAP2.INT3:ECAP3.INT4:ECAP4.INT5:ECAP5.INT6:ECAP6.INT7:ECAP7.INT8:ECAP8.INT9:ECAP9.INT10:ECAP10.INT11:ECAP11.INT12:ECAP12.INT13:ECAP13.INT14:ECAP14.INT15:ECAP15.INT" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR22_G6" acronym="CONTROLSS_INTXBAR22_G6" offset="1688" width="32" description="INT XBAR 22 Input Select.">
		<bitfield id="INTXBAR22_G6_SEL" width="3" begin="2" end="0" resetval="0x0" description="Corresponding INT XBAR G6 Input Select0:EQEP0.INT1:EQEP1.INT2:EQEP2.INT" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR22_G7" acronym="CONTROLSS_INTXBAR22_G7" offset="1692" width="32" description="INT XBAR 22 Input Select.">
		<bitfield id="INTXBAR22_G7_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G7 Input SelectBit0:ADCR0.INT1Bit1:ADCR0.INT2Bit2:ADCR0.INT3Bit3:ADCR0.INT4Bit4:ADCR0.EVTINTBit5:ADCR1.INT1Bit6:ADCR1.INT2Bit7:ADCR1.INT3Bit8:ADCR1.INT4Bit9:ADCR1.EVTINTBit 1031:Reserved" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR22_G8" acronym="CONTROLSS_INTXBAR22_G8" offset="1696" width="32" description="INT XBAR 22 Input Select.">
		<bitfield id="INTXBAR22_G8_SEL" width="20" begin="19" end="0" resetval="0x0" description="Corresponding INT XBAR G8 Input Select0:CMP12SSA0.CTRIPL1:CMP12SSA0.CTRIPH2:CMP12SSA1.CTRIPL3:CMP12SSA1.CTRIPH4:CMP12SSA2.CTRIPL5:CMP12SSA2.CTRIPH6:CMP12SSA3.CTRIPL7:CMP12SSA3.CTRIPH8:CMP12SSA4.CTRIPL9:CMP12SSA4.CTRIPH10:CMP12SSA5.CTRIPL11:CMP12SSA5.CTRIPH12:CMP12SSA6.CTRIPL13:CMP12SSA6.CTRIPH14:CMP12SSA7.CTRIPL15:CMP12SSA7.CTRIPH16:CMP12SSA8.CTRIPL17:CMP12SSA8.CTRIPH18:CMP12SSA9.CTRIPL19:CMP12SSA9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR22_G9" acronym="CONTROLSS_INTXBAR22_G9" offset="1700" width="32" description="INT XBAR 22 Input Select.">
		<bitfield id="INTXBAR22_G9_SEL" width="20" begin="19" end="0" resetval="0x0" description="Corresponding INT XBAR G9 Input Select0:CMP12SSB0.CTRIPL1:CMP12SSB0.CTRIPH2:CMP12SSB1.CTRIPL3:CMP12SSB1.CTRIPH4:CMP12SSB2.CTRIPL5:CMP12SSB2.CTRIPH6:CMP12SSB3.CTRIPL7:CMP12SSB3.CTRIPH8:CMP12SSB4.CTRIPL9:CMP12SSB4.CTRIPH10:CMP12SSB5.CTRIPL11:CMP12SSB5.CTRIPH12:CMP12SSB6.CTRIPL13:CMP12SSB6.CTRIPH14:CMP12SSB7.CTRIPL15:CMP12SSB7.CTRIPH16:CMP12SSB8.CTRIPL17:CMP12SSB8.CTRIPH18:CMP12SSB9.CTRIPL19:CMP12SSB9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR23_G0" acronym="CONTROLSS_INTXBAR23_G0" offset="1728" width="32" description="INT XBAR 23 Input Select.">
		<bitfield id="INTXBAR23_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM INT interrupt to corresponding XBAR1:PWMx.INT is selected0:PWMx.INT is de-selected x can have value from  0 to 31 corresponding to each PWM instance" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR23_G1" acronym="CONTROLSS_INTXBAR23_G1" offset="1732" width="32" description="INT XBAR 23 Input Select.">
