ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263P/CONTROLSS_INTXBAR_CONTROLSS_502D5000h.xml
		<bitfield id="INTXBAR23_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM TZINT interrupt to corresponding XBAR1:PWMx.TZINT is selected0:PWMx.TZINT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR23_G2" acronym="CONTROLSS_INTXBAR23_G2" offset="1736" width="32" description="INT XBAR 23 Input Select.">
		<bitfield id="INTXBAR23_G2_SEL" width="32" begin="31" end="0" resetval="0x0" description="Corresponding INT XBAR G2 Input SelectBit0:ADC0.INT1Bit1:ADC0.INT2Bit2:ADC0.INT3Bit3:ADC0.INT4Bit4:ADC0.EVTINTBit5:ADC1.INT1Bit6:ADC1.INT2Bit7:ADC1.INT3Bit8:ADC1.INT4Bit9:ADC1.EVTINTBit10:ADC2.INT1Bit11:ADC2.INT2Bit12:ADC2.INT3Bit13:ADC2.INT4Bit14:ADC2.EVTINTBit15:ADC3.INT1Bit16:ADC3.INT2Bit17:ADC3.INT3Bit18:ADC3.INT4Bit19:ADC3.EVTINTBit20:ADC4.INT1Bit21:ADC4.INT2Bit22:ADC4.INT3Bit23:ADC4.INT4Bit24:ADC4.EVTINTBit 2530:ReservedBit31:ASC_AGG0.INT" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR23_G3" acronym="CONTROLSS_INTXBAR23_G3" offset="1740" width="32" description="INT XBAR 23 Input Select.">
		<bitfield id="INTXBAR23_G3_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G3 Input Select0:FSIRX0.INT1N1:FSIRX0.INT2N2:FSIRX1.INT1N3:FSIRX1.INT2N4:FSIRX2.INT1N5:FSIRX2.INT2N6:FSIRX3.INT1N7:FSIRX3.INT2N8:FSITX0.INT1N9:FSITX0.INT2N10:FSITX1.INT1N11:FSITX1.INT2N12:FSITX2.INT1N13:FSITX2.INT2N14:FSITX3.INT1N15:FSITX3.INT2N" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR23_G4" acronym="CONTROLSS_INTXBAR23_G4" offset="1744" width="32" description="INT XBAR 23 Input Select.">
		<bitfield id="INTXBAR23_G4_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G4 Input Select0:SD0.ERR1:SD0.FILT1.DRINT2:SD0.FILT2.DRINT3:SD0.FILT3.DRINT4:SD0.FILT4.DRINT5:SD1.ERR6:SD1.FILT1.DRINT7:SD1.FILT2.DRINT8:SD1.FILT3.DRINT9:SD1.FILT4.DRINT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR23_G5" acronym="CONTROLSS_INTXBAR23_G5" offset="1748" width="32" description="INT XBAR 23 Input Select.">
		<bitfield id="INTXBAR23_G5_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G5 Input Select0:ECAP0.INT1:ECAP1.INT2:ECAP2.INT3:ECAP3.INT4:ECAP4.INT5:ECAP5.INT6:ECAP6.INT7:ECAP7.INT8:ECAP8.INT9:ECAP9.INT10:ECAP10.INT11:ECAP11.INT12:ECAP12.INT13:ECAP13.INT14:ECAP14.INT15:ECAP15.INT" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR23_G6" acronym="CONTROLSS_INTXBAR23_G6" offset="1752" width="32" description="INT XBAR 23 Input Select.">
		<bitfield id="INTXBAR23_G6_SEL" width="3" begin="2" end="0" resetval="0x0" description="Corresponding INT XBAR G6 Input Select0:EQEP0.INT1:EQEP1.INT2:EQEP2.INT" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR23_G7" acronym="CONTROLSS_INTXBAR23_G7" offset="1756" width="32" description="INT XBAR 23 Input Select.">
		<bitfield id="INTXBAR23_G7_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G7 Input SelectBit0:ADCR0.INT1Bit1:ADCR0.INT2Bit2:ADCR0.INT3Bit3:ADCR0.INT4Bit4:ADCR0.EVTINTBit5:ADCR1.INT1Bit6:ADCR1.INT2Bit7:ADCR1.INT3Bit8:ADCR1.INT4Bit9:ADCR1.EVTINTBit 1031:Reserved" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR23_G8" acronym="CONTROLSS_INTXBAR23_G8" offset="1760" width="32" description="INT XBAR 23 Input Select.">
		<bitfield id="INTXBAR23_G8_SEL" width="20" begin="19" end="0" resetval="0x0" description="Corresponding INT XBAR G8 Input Select0:CMP12SSA0.CTRIPL1:CMP12SSA0.CTRIPH2:CMP12SSA1.CTRIPL3:CMP12SSA1.CTRIPH4:CMP12SSA2.CTRIPL5:CMP12SSA2.CTRIPH6:CMP12SSA3.CTRIPL7:CMP12SSA3.CTRIPH8:CMP12SSA4.CTRIPL9:CMP12SSA4.CTRIPH10:CMP12SSA5.CTRIPL11:CMP12SSA5.CTRIPH12:CMP12SSA6.CTRIPL13:CMP12SSA6.CTRIPH14:CMP12SSA7.CTRIPL15:CMP12SSA7.CTRIPH16:CMP12SSA8.CTRIPL17:CMP12SSA8.CTRIPH18:CMP12SSA9.CTRIPL19:CMP12SSA9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR23_G9" acronym="CONTROLSS_INTXBAR23_G9" offset="1764" width="32" description="INT XBAR 23 Input Select.">
		<bitfield id="INTXBAR23_G9_SEL" width="20" begin="19" end="0" resetval="0x0" description="Corresponding INT XBAR G9 Input Select0:CMP12SSB0.CTRIPL1:CMP12SSB0.CTRIPH2:CMP12SSB1.CTRIPL3:CMP12SSB1.CTRIPH4:CMP12SSB2.CTRIPL5:CMP12SSB2.CTRIPH6:CMP12SSB3.CTRIPL7:CMP12SSB3.CTRIPH8:CMP12SSB4.CTRIPL9:CMP12SSB4.CTRIPH10:CMP12SSB5.CTRIPL11:CMP12SSB5.CTRIPH12:CMP12SSB6.CTRIPL13:CMP12SSB6.CTRIPH14:CMP12SSB7.CTRIPL15:CMP12SSB7.CTRIPH16:CMP12SSB8.CTRIPL17:CMP12SSB8.CTRIPH18:CMP12SSB9.CTRIPL19:CMP12SSB9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR24_G0" acronym="CONTROLSS_INTXBAR24_G0" offset="1792" width="32" description="INT XBAR 24 Input Select.">
		<bitfield id="INTXBAR24_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM INT interrupt to corresponding XBAR1:PWMx.INT is selected0:PWMx.INT is de-selected x can have value from  0 to 31 corresponding to each PWM instance" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR24_G1" acronym="CONTROLSS_INTXBAR24_G1" offset="1796" width="32" description="INT XBAR 24 Input Select.">
		<bitfield id="INTXBAR24_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM TZINT interrupt to corresponding XBAR1:PWMx.TZINT is selected0:PWMx.TZINT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR24_G2" acronym="CONTROLSS_INTXBAR24_G2" offset="1800" width="32" description="INT XBAR 24 Input Select.">
		<bitfield id="INTXBAR24_G2_SEL" width="32" begin="31" end="0" resetval="0x0" description="Corresponding INT XBAR G2 Input SelectBit0:ADC0.INT1Bit1:ADC0.INT2Bit2:ADC0.INT3Bit3:ADC0.INT4Bit4:ADC0.EVTINTBit5:ADC1.INT1Bit6:ADC1.INT2Bit7:ADC1.INT3Bit8:ADC1.INT4Bit9:ADC1.EVTINTBit10:ADC2.INT1Bit11:ADC2.INT2Bit12:ADC2.INT3Bit13:ADC2.INT4Bit14:ADC2.EVTINTBit15:ADC3.INT1Bit16:ADC3.INT2Bit17:ADC3.INT3Bit18:ADC3.INT4Bit19:ADC3.EVTINTBit20:ADC4.INT1Bit21:ADC4.INT2Bit22:ADC4.INT3Bit23:ADC4.INT4Bit24:ADC4.EVTINTBit 2530:ReservedBit31:ASC_AGG0.INT" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR24_G3" acronym="CONTROLSS_INTXBAR24_G3" offset="1804" width="32" description="INT XBAR 24 Input Select.">
		<bitfield id="INTXBAR24_G3_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G3 Input Select0:FSIRX0.INT1N1:FSIRX0.INT2N2:FSIRX1.INT1N3:FSIRX1.INT2N4:FSIRX2.INT1N5:FSIRX2.INT2N6:FSIRX3.INT1N7:FSIRX3.INT2N8:FSITX0.INT1N9:FSITX0.INT2N10:FSITX1.INT1N11:FSITX1.INT2N12:FSITX2.INT1N13:FSITX2.INT2N14:FSITX3.INT1N15:FSITX3.INT2N" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR24_G4" acronym="CONTROLSS_INTXBAR24_G4" offset="1808" width="32" description="INT XBAR 24 Input Select.">
		<bitfield id="INTXBAR24_G4_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G4 Input Select0:SD0.ERR1:SD0.FILT1.DRINT2:SD0.FILT2.DRINT3:SD0.FILT3.DRINT4:SD0.FILT4.DRINT5:SD1.ERR6:SD1.FILT1.DRINT7:SD1.FILT2.DRINT8:SD1.FILT3.DRINT9:SD1.FILT4.DRINT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR24_G5" acronym="CONTROLSS_INTXBAR24_G5" offset="1812" width="32" description="INT XBAR 24 Input Select.">
		<bitfield id="INTXBAR24_G5_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G5 Input Select0:ECAP0.INT1:ECAP1.INT2:ECAP2.INT3:ECAP3.INT4:ECAP4.INT5:ECAP5.INT6:ECAP6.INT7:ECAP7.INT8:ECAP8.INT9:ECAP9.INT10:ECAP10.INT11:ECAP11.INT12:ECAP12.INT13:ECAP13.INT14:ECAP14.INT15:ECAP15.INT" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR24_G6" acronym="CONTROLSS_INTXBAR24_G6" offset="1816" width="32" description="INT XBAR 24 Input Select.">
		<bitfield id="INTXBAR24_G6_SEL" width="3" begin="2" end="0" resetval="0x0" description="Corresponding INT XBAR G6 Input Select0:EQEP0.INT1:EQEP1.INT2:EQEP2.INT" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR24_G7" acronym="CONTROLSS_INTXBAR24_G7" offset="1820" width="32" description="INT XBAR 24 Input Select.">
		<bitfield id="INTXBAR24_G7_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G7 Input SelectBit0:ADCR0.INT1Bit1:ADCR0.INT2Bit2:ADCR0.INT3Bit3:ADCR0.INT4Bit4:ADCR0.EVTINTBit5:ADCR1.INT1Bit6:ADCR1.INT2Bit7:ADCR1.INT3Bit8:ADCR1.INT4Bit9:ADCR1.EVTINTBit 1031:Reserved" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR24_G8" acronym="CONTROLSS_INTXBAR24_G8" offset="1824" width="32" description="INT XBAR 24 Input Select.">
		<bitfield id="INTXBAR24_G8_SEL" width="20" begin="19" end="0" resetval="0x0" description="Corresponding INT XBAR G8 Input Select0:CMP12SSA0.CTRIPL1:CMP12SSA0.CTRIPH2:CMP12SSA1.CTRIPL3:CMP12SSA1.CTRIPH4:CMP12SSA2.CTRIPL5:CMP12SSA2.CTRIPH6:CMP12SSA3.CTRIPL7:CMP12SSA3.CTRIPH8:CMP12SSA4.CTRIPL9:CMP12SSA4.CTRIPH10:CMP12SSA5.CTRIPL11:CMP12SSA5.CTRIPH12:CMP12SSA6.CTRIPL13:CMP12SSA6.CTRIPH14:CMP12SSA7.CTRIPL15:CMP12SSA7.CTRIPH16:CMP12SSA8.CTRIPL17:CMP12SSA8.CTRIPH18:CMP12SSA9.CTRIPL19:CMP12SSA9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR24_G9" acronym="CONTROLSS_INTXBAR24_G9" offset="1828" width="32" description="INT XBAR 24 Input Select.">
		<bitfield id="INTXBAR24_G9_SEL" width="20" begin="19" end="0" resetval="0x0" description="Corresponding INT XBAR G9 Input Select0:CMP12SSB0.CTRIPL1:CMP12SSB0.CTRIPH2:CMP12SSB1.CTRIPL3:CMP12SSB1.CTRIPH4:CMP12SSB2.CTRIPL5:CMP12SSB2.CTRIPH6:CMP12SSB3.CTRIPL7:CMP12SSB3.CTRIPH8:CMP12SSB4.CTRIPL9:CMP12SSB4.CTRIPH10:CMP12SSB5.CTRIPL11:CMP12SSB5.CTRIPH12:CMP12SSB6.CTRIPL13:CMP12SSB6.CTRIPH14:CMP12SSB7.CTRIPL15:CMP12SSB7.CTRIPH16:CMP12SSB8.CTRIPL17:CMP12SSB8.CTRIPH18:CMP12SSB9.CTRIPL19:CMP12SSB9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR25_G0" acronym="CONTROLSS_INTXBAR25_G0" offset="1856" width="32" description="INT XBAR 25 Input Select.">
		<bitfield id="INTXBAR25_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM INT interrupt to corresponding XBAR1:PWMx.INT is selected0:PWMx.INT is de-selected x can have value from  0 to 31 corresponding to each PWM instance" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR25_G1" acronym="CONTROLSS_INTXBAR25_G1" offset="1860" width="32" description="INT XBAR 25 Input Select.">
		<bitfield id="INTXBAR25_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM TZINT interrupt to corresponding XBAR1:PWMx.TZINT is selected0:PWMx.TZINT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR25_G2" acronym="CONTROLSS_INTXBAR25_G2" offset="1864" width="32" description="INT XBAR 25 Input Select.">
		<bitfield id="INTXBAR25_G2_SEL" width="32" begin="31" end="0" resetval="0x0" description="Corresponding INT XBAR G2 Input SelectBit0:ADC0.INT1Bit1:ADC0.INT2Bit2:ADC0.INT3Bit3:ADC0.INT4Bit4:ADC0.EVTINTBit5:ADC1.INT1Bit6:ADC1.INT2Bit7:ADC1.INT3Bit8:ADC1.INT4Bit9:ADC1.EVTINTBit10:ADC2.INT1Bit11:ADC2.INT2Bit12:ADC2.INT3Bit13:ADC2.INT4Bit14:ADC2.EVTINTBit15:ADC3.INT1Bit16:ADC3.INT2Bit17:ADC3.INT3Bit18:ADC3.INT4Bit19:ADC3.EVTINTBit20:ADC4.INT1Bit21:ADC4.INT2Bit22:ADC4.INT3Bit23:ADC4.INT4Bit24:ADC4.EVTINTBit 2530:ReservedBit31:ASC_AGG0.INT" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR25_G3" acronym="CONTROLSS_INTXBAR25_G3" offset="1868" width="32" description="INT XBAR 25 Input Select.">
		<bitfield id="INTXBAR25_G3_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G3 Input Select0:FSIRX0.INT1N1:FSIRX0.INT2N2:FSIRX1.INT1N3:FSIRX1.INT2N4:FSIRX2.INT1N5:FSIRX2.INT2N6:FSIRX3.INT1N7:FSIRX3.INT2N8:FSITX0.INT1N9:FSITX0.INT2N10:FSITX1.INT1N11:FSITX1.INT2N12:FSITX2.INT1N13:FSITX2.INT2N14:FSITX3.INT1N15:FSITX3.INT2N" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR25_G4" acronym="CONTROLSS_INTXBAR25_G4" offset="1872" width="32" description="INT XBAR 25 Input Select.">
		<bitfield id="INTXBAR25_G4_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G4 Input Select0:SD0.ERR1:SD0.FILT1.DRINT2:SD0.FILT2.DRINT3:SD0.FILT3.DRINT4:SD0.FILT4.DRINT5:SD1.ERR6:SD1.FILT1.DRINT7:SD1.FILT2.DRINT8:SD1.FILT3.DRINT9:SD1.FILT4.DRINT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR25_G5" acronym="CONTROLSS_INTXBAR25_G5" offset="1876" width="32" description="INT XBAR 25 Input Select.">
		<bitfield id="INTXBAR25_G5_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G5 Input Select0:ECAP0.INT1:ECAP1.INT2:ECAP2.INT3:ECAP3.INT4:ECAP4.INT5:ECAP5.INT6:ECAP6.INT7:ECAP7.INT8:ECAP8.INT9:ECAP9.INT10:ECAP10.INT11:ECAP11.INT12:ECAP12.INT13:ECAP13.INT14:ECAP14.INT15:ECAP15.INT" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR25_G6" acronym="CONTROLSS_INTXBAR25_G6" offset="1880" width="32" description="INT XBAR 25 Input Select.">
		<bitfield id="INTXBAR25_G6_SEL" width="3" begin="2" end="0" resetval="0x0" description="Corresponding INT XBAR G6 Input Select0:EQEP0.INT1:EQEP1.INT2:EQEP2.INT" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR25_G7" acronym="CONTROLSS_INTXBAR25_G7" offset="1884" width="32" description="INT XBAR 25 Input Select.">
		<bitfield id="INTXBAR25_G7_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G7 Input SelectBit0:ADCR0.INT1Bit1:ADCR0.INT2Bit2:ADCR0.INT3Bit3:ADCR0.INT4Bit4:ADCR0.EVTINTBit5:ADCR1.INT1Bit6:ADCR1.INT2Bit7:ADCR1.INT3Bit8:ADCR1.INT4Bit9:ADCR1.EVTINTBit 1031:Reserved" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR25_G8" acronym="CONTROLSS_INTXBAR25_G8" offset="1888" width="32" description="INT XBAR 25 Input Select.">
		<bitfield id="INTXBAR25_G8_SEL" width="20" begin="19" end="0" resetval="0x0" description="Corresponding INT XBAR G8 Input Select0:CMP12SSA0.CTRIPL1:CMP12SSA0.CTRIPH2:CMP12SSA1.CTRIPL3:CMP12SSA1.CTRIPH4:CMP12SSA2.CTRIPL5:CMP12SSA2.CTRIPH6:CMP12SSA3.CTRIPL7:CMP12SSA3.CTRIPH8:CMP12SSA4.CTRIPL9:CMP12SSA4.CTRIPH10:CMP12SSA5.CTRIPL11:CMP12SSA5.CTRIPH12:CMP12SSA6.CTRIPL13:CMP12SSA6.CTRIPH14:CMP12SSA7.CTRIPL15:CMP12SSA7.CTRIPH16:CMP12SSA8.CTRIPL17:CMP12SSA8.CTRIPH18:CMP12SSA9.CTRIPL19:CMP12SSA9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR25_G9" acronym="CONTROLSS_INTXBAR25_G9" offset="1892" width="32" description="INT XBAR 25 Input Select.">
		<bitfield id="INTXBAR25_G9_SEL" width="20" begin="19" end="0" resetval="0x0" description="Corresponding INT XBAR G9 Input Select0:CMP12SSB0.CTRIPL1:CMP12SSB0.CTRIPH2:CMP12SSB1.CTRIPL3:CMP12SSB1.CTRIPH4:CMP12SSB2.CTRIPL5:CMP12SSB2.CTRIPH6:CMP12SSB3.CTRIPL7:CMP12SSB3.CTRIPH8:CMP12SSB4.CTRIPL9:CMP12SSB4.CTRIPH10:CMP12SSB5.CTRIPL11:CMP12SSB5.CTRIPH12:CMP12SSB6.CTRIPL13:CMP12SSB6.CTRIPH14:CMP12SSB7.CTRIPL15:CMP12SSB7.CTRIPH16:CMP12SSB8.CTRIPL17:CMP12SSB8.CTRIPH18:CMP12SSB9.CTRIPL19:CMP12SSB9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR26_G0" acronym="CONTROLSS_INTXBAR26_G0" offset="1920" width="32" description="INT XBAR 26 Input Select.">
		<bitfield id="INTXBAR26_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM INT interrupt to corresponding XBAR1:PWMx.INT is selected0:PWMx.INT is de-selected x can have value from  0 to 31 corresponding to each PWM instance" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR26_G1" acronym="CONTROLSS_INTXBAR26_G1" offset="1924" width="32" description="INT XBAR 26 Input Select.">
		<bitfield id="INTXBAR26_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM TZINT interrupt to corresponding XBAR1:PWMx.TZINT is selected0:PWMx.TZINT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR26_G2" acronym="CONTROLSS_INTXBAR26_G2" offset="1928" width="32" description="INT XBAR 26 Input Select.">
		<bitfield id="INTXBAR26_G2_SEL" width="32" begin="31" end="0" resetval="0x0" description="Corresponding INT XBAR G2 Input SelectBit0:ADC0.INT1Bit1:ADC0.INT2Bit2:ADC0.INT3Bit3:ADC0.INT4Bit4:ADC0.EVTINTBit5:ADC1.INT1Bit6:ADC1.INT2Bit7:ADC1.INT3Bit8:ADC1.INT4Bit9:ADC1.EVTINTBit10:ADC2.INT1Bit11:ADC2.INT2Bit12:ADC2.INT3Bit13:ADC2.INT4Bit14:ADC2.EVTINTBit15:ADC3.INT1Bit16:ADC3.INT2Bit17:ADC3.INT3Bit18:ADC3.INT4Bit19:ADC3.EVTINTBit20:ADC4.INT1Bit21:ADC4.INT2Bit22:ADC4.INT3Bit23:ADC4.INT4Bit24:ADC4.EVTINTBit 2530:ReservedBit31:ASC_AGG0.INT" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR26_G3" acronym="CONTROLSS_INTXBAR26_G3" offset="1932" width="32" description="INT XBAR 26 Input Select.">
		<bitfield id="INTXBAR26_G3_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G3 Input Select0:FSIRX0.INT1N1:FSIRX0.INT2N2:FSIRX1.INT1N3:FSIRX1.INT2N4:FSIRX2.INT1N5:FSIRX2.INT2N6:FSIRX3.INT1N7:FSIRX3.INT2N8:FSITX0.INT1N9:FSITX0.INT2N10:FSITX1.INT1N11:FSITX1.INT2N12:FSITX2.INT1N13:FSITX2.INT2N14:FSITX3.INT1N15:FSITX3.INT2N" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR26_G4" acronym="CONTROLSS_INTXBAR26_G4" offset="1936" width="32" description="INT XBAR 26 Input Select.">
		<bitfield id="INTXBAR26_G4_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G4 Input Select0:SD0.ERR1:SD0.FILT1.DRINT2:SD0.FILT2.DRINT3:SD0.FILT3.DRINT4:SD0.FILT4.DRINT5:SD1.ERR6:SD1.FILT1.DRINT7:SD1.FILT2.DRINT8:SD1.FILT3.DRINT9:SD1.FILT4.DRINT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR26_G5" acronym="CONTROLSS_INTXBAR26_G5" offset="1940" width="32" description="INT XBAR 26 Input Select.">
		<bitfield id="INTXBAR26_G5_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G5 Input Select0:ECAP0.INT1:ECAP1.INT2:ECAP2.INT3:ECAP3.INT4:ECAP4.INT5:ECAP5.INT6:ECAP6.INT7:ECAP7.INT8:ECAP8.INT9:ECAP9.INT10:ECAP10.INT11:ECAP11.INT12:ECAP12.INT13:ECAP13.INT14:ECAP14.INT15:ECAP15.INT" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR26_G6" acronym="CONTROLSS_INTXBAR26_G6" offset="1944" width="32" description="INT XBAR 26 Input Select.">
		<bitfield id="INTXBAR26_G6_SEL" width="3" begin="2" end="0" resetval="0x0" description="Corresponding INT XBAR G6 Input Select0:EQEP0.INT1:EQEP1.INT2:EQEP2.INT" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR26_G7" acronym="CONTROLSS_INTXBAR26_G7" offset="1948" width="32" description="INT XBAR 26 Input Select.">
		<bitfield id="INTXBAR26_G7_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G7 Input SelectBit0:ADCR0.INT1Bit1:ADCR0.INT2Bit2:ADCR0.INT3Bit3:ADCR0.INT4Bit4:ADCR0.EVTINTBit5:ADCR1.INT1Bit6:ADCR1.INT2Bit7:ADCR1.INT3Bit8:ADCR1.INT4Bit9:ADCR1.EVTINTBit 1031:Reserved" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR26_G8" acronym="CONTROLSS_INTXBAR26_G8" offset="1952" width="32" description="INT XBAR 26 Input Select.">
		<bitfield id="INTXBAR26_G8_SEL" width="20" begin="19" end="0" resetval="0x0" description="Corresponding INT XBAR G8 Input Select0:CMP12SSA0.CTRIPL1:CMP12SSA0.CTRIPH2:CMP12SSA1.CTRIPL3:CMP12SSA1.CTRIPH4:CMP12SSA2.CTRIPL5:CMP12SSA2.CTRIPH6:CMP12SSA3.CTRIPL7:CMP12SSA3.CTRIPH8:CMP12SSA4.CTRIPL9:CMP12SSA4.CTRIPH10:CMP12SSA5.CTRIPL11:CMP12SSA5.CTRIPH12:CMP12SSA6.CTRIPL13:CMP12SSA6.CTRIPH14:CMP12SSA7.CTRIPL15:CMP12SSA7.CTRIPH16:CMP12SSA8.CTRIPL17:CMP12SSA8.CTRIPH18:CMP12SSA9.CTRIPL19:CMP12SSA9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR26_G9" acronym="CONTROLSS_INTXBAR26_G9" offset="1956" width="32" description="INT XBAR 26 Input Select.">
		<bitfield id="INTXBAR26_G9_SEL" width="20" begin="19" end="0" resetval="0x0" description="Corresponding INT XBAR G9 Input Select0:CMP12SSB0.CTRIPL1:CMP12SSB0.CTRIPH2:CMP12SSB1.CTRIPL3:CMP12SSB1.CTRIPH4:CMP12SSB2.CTRIPL5:CMP12SSB2.CTRIPH6:CMP12SSB3.CTRIPL7:CMP12SSB3.CTRIPH8:CMP12SSB4.CTRIPL9:CMP12SSB4.CTRIPH10:CMP12SSB5.CTRIPL11:CMP12SSB5.CTRIPH12:CMP12SSB6.CTRIPL13:CMP12SSB6.CTRIPH14:CMP12SSB7.CTRIPL15:CMP12SSB7.CTRIPH16:CMP12SSB8.CTRIPL17:CMP12SSB8.CTRIPH18:CMP12SSB9.CTRIPL19:CMP12SSB9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR27_G0" acronym="CONTROLSS_INTXBAR27_G0" offset="1984" width="32" description="INT XBAR 27 Input Select.">
		<bitfield id="INTXBAR27_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM INT interrupt to corresponding XBAR1:PWMx.INT is selected0:PWMx.INT is de-selected x can have value from  0 to 31 corresponding to each PWM instance" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR27_G1" acronym="CONTROLSS_INTXBAR27_G1" offset="1988" width="32" description="INT XBAR 27 Input Select.">
		<bitfield id="INTXBAR27_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM TZINT interrupt to corresponding XBAR1:PWMx.TZINT is selected0:PWMx.TZINT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR27_G2" acronym="CONTROLSS_INTXBAR27_G2" offset="1992" width="32" description="INT XBAR 27 Input Select.">
		<bitfield id="INTXBAR27_G2_SEL" width="32" begin="31" end="0" resetval="0x0" description="Corresponding INT XBAR G2 Input SelectBit0:ADC0.INT1Bit1:ADC0.INT2Bit2:ADC0.INT3Bit3:ADC0.INT4Bit4:ADC0.EVTINTBit5:ADC1.INT1Bit6:ADC1.INT2Bit7:ADC1.INT3Bit8:ADC1.INT4Bit9:ADC1.EVTINTBit10:ADC2.INT1Bit11:ADC2.INT2Bit12:ADC2.INT3Bit13:ADC2.INT4Bit14:ADC2.EVTINTBit15:ADC3.INT1Bit16:ADC3.INT2Bit17:ADC3.INT3Bit18:ADC3.INT4Bit19:ADC3.EVTINTBit20:ADC4.INT1Bit21:ADC4.INT2Bit22:ADC4.INT3Bit23:ADC4.INT4Bit24:ADC4.EVTINTBit 2530:ReservedBit31:ASC_AGG0.INT" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR27_G3" acronym="CONTROLSS_INTXBAR27_G3" offset="1996" width="32" description="INT XBAR 27 Input Select.">
		<bitfield id="INTXBAR27_G3_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G3 Input Select0:FSIRX0.INT1N1:FSIRX0.INT2N2:FSIRX1.INT1N3:FSIRX1.INT2N4:FSIRX2.INT1N5:FSIRX2.INT2N6:FSIRX3.INT1N7:FSIRX3.INT2N8:FSITX0.INT1N9:FSITX0.INT2N10:FSITX1.INT1N11:FSITX1.INT2N12:FSITX2.INT1N13:FSITX2.INT2N14:FSITX3.INT1N15:FSITX3.INT2N" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR27_G4" acronym="CONTROLSS_INTXBAR27_G4" offset="2000" width="32" description="INT XBAR 27 Input Select.">
		<bitfield id="INTXBAR27_G4_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G4 Input Select0:SD0.ERR1:SD0.FILT1.DRINT2:SD0.FILT2.DRINT3:SD0.FILT3.DRINT4:SD0.FILT4.DRINT5:SD1.ERR6:SD1.FILT1.DRINT7:SD1.FILT2.DRINT8:SD1.FILT3.DRINT9:SD1.FILT4.DRINT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR27_G5" acronym="CONTROLSS_INTXBAR27_G5" offset="2004" width="32" description="INT XBAR 27 Input Select.">
		<bitfield id="INTXBAR27_G5_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G5 Input Select0:ECAP0.INT1:ECAP1.INT2:ECAP2.INT3:ECAP3.INT4:ECAP4.INT5:ECAP5.INT6:ECAP6.INT7:ECAP7.INT8:ECAP8.INT9:ECAP9.INT10:ECAP10.INT11:ECAP11.INT12:ECAP12.INT13:ECAP13.INT14:ECAP14.INT15:ECAP15.INT" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR27_G6" acronym="CONTROLSS_INTXBAR27_G6" offset="2008" width="32" description="INT XBAR 27 Input Select.">
		<bitfield id="INTXBAR27_G6_SEL" width="3" begin="2" end="0" resetval="0x0" description="Corresponding INT XBAR G6 Input Select0:EQEP0.INT1:EQEP1.INT2:EQEP2.INT" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR27_G7" acronym="CONTROLSS_INTXBAR27_G7" offset="2012" width="32" description="INT XBAR 27 Input Select.">
