ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263P/CONTROLSS_INTXBAR_CONTROLSS_502D5000h.xml
		<bitfield id="INTXBAR27_G7_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G7 Input SelectBit0:ADCR0.INT1Bit1:ADCR0.INT2Bit2:ADCR0.INT3Bit3:ADCR0.INT4Bit4:ADCR0.EVTINTBit5:ADCR1.INT1Bit6:ADCR1.INT2Bit7:ADCR1.INT3Bit8:ADCR1.INT4Bit9:ADCR1.EVTINTBit 1031:Reserved" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR27_G8" acronym="CONTROLSS_INTXBAR27_G8" offset="2016" width="32" description="INT XBAR 27 Input Select.">
		<bitfield id="INTXBAR27_G8_SEL" width="20" begin="19" end="0" resetval="0x0" description="Corresponding INT XBAR G8 Input Select0:CMP12SSA0.CTRIPL1:CMP12SSA0.CTRIPH2:CMP12SSA1.CTRIPL3:CMP12SSA1.CTRIPH4:CMP12SSA2.CTRIPL5:CMP12SSA2.CTRIPH6:CMP12SSA3.CTRIPL7:CMP12SSA3.CTRIPH8:CMP12SSA4.CTRIPL9:CMP12SSA4.CTRIPH10:CMP12SSA5.CTRIPL11:CMP12SSA5.CTRIPH12:CMP12SSA6.CTRIPL13:CMP12SSA6.CTRIPH14:CMP12SSA7.CTRIPL15:CMP12SSA7.CTRIPH16:CMP12SSA8.CTRIPL17:CMP12SSA8.CTRIPH18:CMP12SSA9.CTRIPL19:CMP12SSA9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR27_G9" acronym="CONTROLSS_INTXBAR27_G9" offset="2020" width="32" description="INT XBAR 27 Input Select.">
		<bitfield id="INTXBAR27_G9_SEL" width="20" begin="19" end="0" resetval="0x0" description="Corresponding INT XBAR G9 Input Select0:CMP12SSB0.CTRIPL1:CMP12SSB0.CTRIPH2:CMP12SSB1.CTRIPL3:CMP12SSB1.CTRIPH4:CMP12SSB2.CTRIPL5:CMP12SSB2.CTRIPH6:CMP12SSB3.CTRIPL7:CMP12SSB3.CTRIPH8:CMP12SSB4.CTRIPL9:CMP12SSB4.CTRIPH10:CMP12SSB5.CTRIPL11:CMP12SSB5.CTRIPH12:CMP12SSB6.CTRIPL13:CMP12SSB6.CTRIPH14:CMP12SSB7.CTRIPL15:CMP12SSB7.CTRIPH16:CMP12SSB8.CTRIPL17:CMP12SSB8.CTRIPH18:CMP12SSB9.CTRIPL19:CMP12SSB9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR28_G0" acronym="CONTROLSS_INTXBAR28_G0" offset="2048" width="32" description="INT XBAR 28 Input Select.">
		<bitfield id="INTXBAR28_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM INT interrupt to corresponding XBAR1:PWMx.INT is selected0:PWMx.INT is de-selected x can have value from  0 to 31 corresponding to each PWM instance" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR28_G1" acronym="CONTROLSS_INTXBAR28_G1" offset="2052" width="32" description="INT XBAR 28 Input Select.">
		<bitfield id="INTXBAR28_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM TZINT interrupt to corresponding XBAR1:PWMx.TZINT is selected0:PWMx.TZINT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR28_G2" acronym="CONTROLSS_INTXBAR28_G2" offset="2056" width="32" description="INT XBAR 28 Input Select.">
		<bitfield id="INTXBAR28_G2_SEL" width="32" begin="31" end="0" resetval="0x0" description="Corresponding INT XBAR G2 Input SelectBit0:ADC0.INT1Bit1:ADC0.INT2Bit2:ADC0.INT3Bit3:ADC0.INT4Bit4:ADC0.EVTINTBit5:ADC1.INT1Bit6:ADC1.INT2Bit7:ADC1.INT3Bit8:ADC1.INT4Bit9:ADC1.EVTINTBit10:ADC2.INT1Bit11:ADC2.INT2Bit12:ADC2.INT3Bit13:ADC2.INT4Bit14:ADC2.EVTINTBit15:ADC3.INT1Bit16:ADC3.INT2Bit17:ADC3.INT3Bit18:ADC3.INT4Bit19:ADC3.EVTINTBit20:ADC4.INT1Bit21:ADC4.INT2Bit22:ADC4.INT3Bit23:ADC4.INT4Bit24:ADC4.EVTINTBit 2530:ReservedBit31:ASC_AGG0.INT" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR28_G3" acronym="CONTROLSS_INTXBAR28_G3" offset="2060" width="32" description="INT XBAR 28 Input Select.">
		<bitfield id="INTXBAR28_G3_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G3 Input Select0:FSIRX0.INT1N1:FSIRX0.INT2N2:FSIRX1.INT1N3:FSIRX1.INT2N4:FSIRX2.INT1N5:FSIRX2.INT2N6:FSIRX3.INT1N7:FSIRX3.INT2N8:FSITX0.INT1N9:FSITX0.INT2N10:FSITX1.INT1N11:FSITX1.INT2N12:FSITX2.INT1N13:FSITX2.INT2N14:FSITX3.INT1N15:FSITX3.INT2N" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR28_G4" acronym="CONTROLSS_INTXBAR28_G4" offset="2064" width="32" description="INT XBAR 28 Input Select.">
		<bitfield id="INTXBAR28_G4_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G4 Input Select0:SD0.ERR1:SD0.FILT1.DRINT2:SD0.FILT2.DRINT3:SD0.FILT3.DRINT4:SD0.FILT4.DRINT5:SD1.ERR6:SD1.FILT1.DRINT7:SD1.FILT2.DRINT8:SD1.FILT3.DRINT9:SD1.FILT4.DRINT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR28_G5" acronym="CONTROLSS_INTXBAR28_G5" offset="2068" width="32" description="INT XBAR 28 Input Select.">
		<bitfield id="INTXBAR28_G5_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G5 Input Select0:ECAP0.INT1:ECAP1.INT2:ECAP2.INT3:ECAP3.INT4:ECAP4.INT5:ECAP5.INT6:ECAP6.INT7:ECAP7.INT8:ECAP8.INT9:ECAP9.INT10:ECAP10.INT11:ECAP11.INT12:ECAP12.INT13:ECAP13.INT14:ECAP14.INT15:ECAP15.INT" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR28_G6" acronym="CONTROLSS_INTXBAR28_G6" offset="2072" width="32" description="INT XBAR 28 Input Select.">
		<bitfield id="INTXBAR28_G6_SEL" width="3" begin="2" end="0" resetval="0x0" description="Corresponding INT XBAR G6 Input Select0:EQEP0.INT1:EQEP1.INT2:EQEP2.INT" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR28_G7" acronym="CONTROLSS_INTXBAR28_G7" offset="2076" width="32" description="INT XBAR 28 Input Select.">
		<bitfield id="INTXBAR28_G7_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G7 Input SelectBit0:ADCR0.INT1Bit1:ADCR0.INT2Bit2:ADCR0.INT3Bit3:ADCR0.INT4Bit4:ADCR0.EVTINTBit5:ADCR1.INT1Bit6:ADCR1.INT2Bit7:ADCR1.INT3Bit8:ADCR1.INT4Bit9:ADCR1.EVTINTBit 1031:Reserved" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR28_G8" acronym="CONTROLSS_INTXBAR28_G8" offset="2080" width="32" description="INT XBAR 28 Input Select.">
		<bitfield id="INTXBAR28_G8_SEL" width="20" begin="19" end="0" resetval="0x0" description="Corresponding INT XBAR G8 Input Select0:CMP12SSA0.CTRIPL1:CMP12SSA0.CTRIPH2:CMP12SSA1.CTRIPL3:CMP12SSA1.CTRIPH4:CMP12SSA2.CTRIPL5:CMP12SSA2.CTRIPH6:CMP12SSA3.CTRIPL7:CMP12SSA3.CTRIPH8:CMP12SSA4.CTRIPL9:CMP12SSA4.CTRIPH10:CMP12SSA5.CTRIPL11:CMP12SSA5.CTRIPH12:CMP12SSA6.CTRIPL13:CMP12SSA6.CTRIPH14:CMP12SSA7.CTRIPL15:CMP12SSA7.CTRIPH16:CMP12SSA8.CTRIPL17:CMP12SSA8.CTRIPH18:CMP12SSA9.CTRIPL19:CMP12SSA9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR28_G9" acronym="CONTROLSS_INTXBAR28_G9" offset="2084" width="32" description="INT XBAR 28 Input Select.">
		<bitfield id="INTXBAR28_G9_SEL" width="20" begin="19" end="0" resetval="0x0" description="Corresponding INT XBAR G9 Input Select0:CMP12SSB0.CTRIPL1:CMP12SSB0.CTRIPH2:CMP12SSB1.CTRIPL3:CMP12SSB1.CTRIPH4:CMP12SSB2.CTRIPL5:CMP12SSB2.CTRIPH6:CMP12SSB3.CTRIPL7:CMP12SSB3.CTRIPH8:CMP12SSB4.CTRIPL9:CMP12SSB4.CTRIPH10:CMP12SSB5.CTRIPL11:CMP12SSB5.CTRIPH12:CMP12SSB6.CTRIPL13:CMP12SSB6.CTRIPH14:CMP12SSB7.CTRIPL15:CMP12SSB7.CTRIPH16:CMP12SSB8.CTRIPL17:CMP12SSB8.CTRIPH18:CMP12SSB9.CTRIPL19:CMP12SSB9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR29_G0" acronym="CONTROLSS_INTXBAR29_G0" offset="2112" width="32" description="INT XBAR 29 Input Select.">
		<bitfield id="INTXBAR29_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM INT interrupt to corresponding XBAR1:PWMx.INT is selected0:PWMx.INT is de-selected x can have value from  0 to 31 corresponding to each PWM instance" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR29_G1" acronym="CONTROLSS_INTXBAR29_G1" offset="2116" width="32" description="INT XBAR 29 Input Select.">
		<bitfield id="INTXBAR29_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM TZINT interrupt to corresponding XBAR1:PWMx.TZINT is selected0:PWMx.TZINT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR29_G2" acronym="CONTROLSS_INTXBAR29_G2" offset="2120" width="32" description="INT XBAR 29 Input Select.">
		<bitfield id="INTXBAR29_G2_SEL" width="32" begin="31" end="0" resetval="0x0" description="Corresponding INT XBAR G2 Input SelectBit0:ADC0.INT1Bit1:ADC0.INT2Bit2:ADC0.INT3Bit3:ADC0.INT4Bit4:ADC0.EVTINTBit5:ADC1.INT1Bit6:ADC1.INT2Bit7:ADC1.INT3Bit8:ADC1.INT4Bit9:ADC1.EVTINTBit10:ADC2.INT1Bit11:ADC2.INT2Bit12:ADC2.INT3Bit13:ADC2.INT4Bit14:ADC2.EVTINTBit15:ADC3.INT1Bit16:ADC3.INT2Bit17:ADC3.INT3Bit18:ADC3.INT4Bit19:ADC3.EVTINTBit20:ADC4.INT1Bit21:ADC4.INT2Bit22:ADC4.INT3Bit23:ADC4.INT4Bit24:ADC4.EVTINTBit 2530:ReservedBit31:ASC_AGG0.INT" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR29_G3" acronym="CONTROLSS_INTXBAR29_G3" offset="2124" width="32" description="INT XBAR 29 Input Select.">
		<bitfield id="INTXBAR29_G3_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G3 Input Select0:FSIRX0.INT1N1:FSIRX0.INT2N2:FSIRX1.INT1N3:FSIRX1.INT2N4:FSIRX2.INT1N5:FSIRX2.INT2N6:FSIRX3.INT1N7:FSIRX3.INT2N8:FSITX0.INT1N9:FSITX0.INT2N10:FSITX1.INT1N11:FSITX1.INT2N12:FSITX2.INT1N13:FSITX2.INT2N14:FSITX3.INT1N15:FSITX3.INT2N" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR29_G4" acronym="CONTROLSS_INTXBAR29_G4" offset="2128" width="32" description="INT XBAR 29 Input Select.">
		<bitfield id="INTXBAR29_G4_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G4 Input Select0:SD0.ERR1:SD0.FILT1.DRINT2:SD0.FILT2.DRINT3:SD0.FILT3.DRINT4:SD0.FILT4.DRINT5:SD1.ERR6:SD1.FILT1.DRINT7:SD1.FILT2.DRINT8:SD1.FILT3.DRINT9:SD1.FILT4.DRINT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR29_G5" acronym="CONTROLSS_INTXBAR29_G5" offset="2132" width="32" description="INT XBAR 29 Input Select.">
		<bitfield id="INTXBAR29_G5_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G5 Input Select0:ECAP0.INT1:ECAP1.INT2:ECAP2.INT3:ECAP3.INT4:ECAP4.INT5:ECAP5.INT6:ECAP6.INT7:ECAP7.INT8:ECAP8.INT9:ECAP9.INT10:ECAP10.INT11:ECAP11.INT12:ECAP12.INT13:ECAP13.INT14:ECAP14.INT15:ECAP15.INT" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR29_G6" acronym="CONTROLSS_INTXBAR29_G6" offset="2136" width="32" description="INT XBAR 29 Input Select.">
		<bitfield id="INTXBAR29_G6_SEL" width="3" begin="2" end="0" resetval="0x0" description="Corresponding INT XBAR G6 Input Select0:EQEP0.INT1:EQEP1.INT2:EQEP2.INT" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR29_G7" acronym="CONTROLSS_INTXBAR29_G7" offset="2140" width="32" description="INT XBAR 29 Input Select.">
		<bitfield id="INTXBAR29_G7_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G7 Input SelectBit0:ADCR0.INT1Bit1:ADCR0.INT2Bit2:ADCR0.INT3Bit3:ADCR0.INT4Bit4:ADCR0.EVTINTBit5:ADCR1.INT1Bit6:ADCR1.INT2Bit7:ADCR1.INT3Bit8:ADCR1.INT4Bit9:ADCR1.EVTINTBit 1031:Reserved" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR29_G8" acronym="CONTROLSS_INTXBAR29_G8" offset="2144" width="32" description="INT XBAR 29 Input Select.">
		<bitfield id="INTXBAR29_G8_SEL" width="20" begin="19" end="0" resetval="0x0" description="Corresponding INT XBAR G8 Input Select0:CMP12SSA0.CTRIPL1:CMP12SSA0.CTRIPH2:CMP12SSA1.CTRIPL3:CMP12SSA1.CTRIPH4:CMP12SSA2.CTRIPL5:CMP12SSA2.CTRIPH6:CMP12SSA3.CTRIPL7:CMP12SSA3.CTRIPH8:CMP12SSA4.CTRIPL9:CMP12SSA4.CTRIPH10:CMP12SSA5.CTRIPL11:CMP12SSA5.CTRIPH12:CMP12SSA6.CTRIPL13:CMP12SSA6.CTRIPH14:CMP12SSA7.CTRIPL15:CMP12SSA7.CTRIPH16:CMP12SSA8.CTRIPL17:CMP12SSA8.CTRIPH18:CMP12SSA9.CTRIPL19:CMP12SSA9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR29_G9" acronym="CONTROLSS_INTXBAR29_G9" offset="2148" width="32" description="INT XBAR 29 Input Select.">
		<bitfield id="INTXBAR29_G9_SEL" width="20" begin="19" end="0" resetval="0x0" description="Corresponding INT XBAR G9 Input Select0:CMP12SSB0.CTRIPL1:CMP12SSB0.CTRIPH2:CMP12SSB1.CTRIPL3:CMP12SSB1.CTRIPH4:CMP12SSB2.CTRIPL5:CMP12SSB2.CTRIPH6:CMP12SSB3.CTRIPL7:CMP12SSB3.CTRIPH8:CMP12SSB4.CTRIPL9:CMP12SSB4.CTRIPH10:CMP12SSB5.CTRIPL11:CMP12SSB5.CTRIPH12:CMP12SSB6.CTRIPL13:CMP12SSB6.CTRIPH14:CMP12SSB7.CTRIPL15:CMP12SSB7.CTRIPH16:CMP12SSB8.CTRIPL17:CMP12SSB8.CTRIPH18:CMP12SSB9.CTRIPL19:CMP12SSB9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR30_G0" acronym="CONTROLSS_INTXBAR30_G0" offset="2176" width="32" description="INT XBAR 30 Input Select.">
		<bitfield id="INTXBAR30_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM INT interrupt to corresponding XBAR1:PWMx.INT is selected0:PWMx.INT is de-selected x can have value from  0 to 31 corresponding to each PWM instance" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR30_G1" acronym="CONTROLSS_INTXBAR30_G1" offset="2180" width="32" description="INT XBAR 30 Input Select.">
		<bitfield id="INTXBAR30_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM TZINT interrupt to corresponding XBAR1:PWMx.TZINT is selected0:PWMx.TZINT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR30_G2" acronym="CONTROLSS_INTXBAR30_G2" offset="2184" width="32" description="INT XBAR 30 Input Select.">
		<bitfield id="INTXBAR30_G2_SEL" width="32" begin="31" end="0" resetval="0x0" description="Corresponding INT XBAR G2 Input SelectBit0:ADC0.INT1Bit1:ADC0.INT2Bit2:ADC0.INT3Bit3:ADC0.INT4Bit4:ADC0.EVTINTBit5:ADC1.INT1Bit6:ADC1.INT2Bit7:ADC1.INT3Bit8:ADC1.INT4Bit9:ADC1.EVTINTBit10:ADC2.INT1Bit11:ADC2.INT2Bit12:ADC2.INT3Bit13:ADC2.INT4Bit14:ADC2.EVTINTBit15:ADC3.INT1Bit16:ADC3.INT2Bit17:ADC3.INT3Bit18:ADC3.INT4Bit19:ADC3.EVTINTBit20:ADC4.INT1Bit21:ADC4.INT2Bit22:ADC4.INT3Bit23:ADC4.INT4Bit24:ADC4.EVTINTBit 2530:ReservedBit31:ASC_AGG0.INT" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR30_G3" acronym="CONTROLSS_INTXBAR30_G3" offset="2188" width="32" description="INT XBAR 30 Input Select.">
		<bitfield id="INTXBAR30_G3_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G3 Input Select0:FSIRX0.INT1N1:FSIRX0.INT2N2:FSIRX1.INT1N3:FSIRX1.INT2N4:FSIRX2.INT1N5:FSIRX2.INT2N6:FSIRX3.INT1N7:FSIRX3.INT2N8:FSITX0.INT1N9:FSITX0.INT2N10:FSITX1.INT1N11:FSITX1.INT2N12:FSITX2.INT1N13:FSITX2.INT2N14:FSITX3.INT1N15:FSITX3.INT2N" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR30_G4" acronym="CONTROLSS_INTXBAR30_G4" offset="2192" width="32" description="INT XBAR 30 Input Select.">
		<bitfield id="INTXBAR30_G4_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G4 Input Select0:SD0.ERR1:SD0.FILT1.DRINT2:SD0.FILT2.DRINT3:SD0.FILT3.DRINT4:SD0.FILT4.DRINT5:SD1.ERR6:SD1.FILT1.DRINT7:SD1.FILT2.DRINT8:SD1.FILT3.DRINT9:SD1.FILT4.DRINT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR30_G5" acronym="CONTROLSS_INTXBAR30_G5" offset="2196" width="32" description="INT XBAR 30 Input Select.">
		<bitfield id="INTXBAR30_G5_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G5 Input Select0:ECAP0.INT1:ECAP1.INT2:ECAP2.INT3:ECAP3.INT4:ECAP4.INT5:ECAP5.INT6:ECAP6.INT7:ECAP7.INT8:ECAP8.INT9:ECAP9.INT10:ECAP10.INT11:ECAP11.INT12:ECAP12.INT13:ECAP13.INT14:ECAP14.INT15:ECAP15.INT" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR30_G6" acronym="CONTROLSS_INTXBAR30_G6" offset="2200" width="32" description="INT XBAR 30 Input Select.">
		<bitfield id="INTXBAR30_G6_SEL" width="3" begin="2" end="0" resetval="0x0" description="Corresponding INT XBAR G6 Input Select0:EQEP0.INT1:EQEP1.INT2:EQEP2.INT" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR30_G7" acronym="CONTROLSS_INTXBAR30_G7" offset="2204" width="32" description="INT XBAR 30 Input Select.">
		<bitfield id="INTXBAR30_G7_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G7 Input SelectBit0:ADCR0.INT1Bit1:ADCR0.INT2Bit2:ADCR0.INT3Bit3:ADCR0.INT4Bit4:ADCR0.EVTINTBit5:ADCR1.INT1Bit6:ADCR1.INT2Bit7:ADCR1.INT3Bit8:ADCR1.INT4Bit9:ADCR1.EVTINTBit 1031:Reserved" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR30_G8" acronym="CONTROLSS_INTXBAR30_G8" offset="2208" width="32" description="INT XBAR 30 Input Select.">
		<bitfield id="INTXBAR30_G8_SEL" width="20" begin="19" end="0" resetval="0x0" description="Corresponding INT XBAR G8 Input Select0:CMP12SSA0.CTRIPL1:CMP12SSA0.CTRIPH2:CMP12SSA1.CTRIPL3:CMP12SSA1.CTRIPH4:CMP12SSA2.CTRIPL5:CMP12SSA2.CTRIPH6:CMP12SSA3.CTRIPL7:CMP12SSA3.CTRIPH8:CMP12SSA4.CTRIPL9:CMP12SSA4.CTRIPH10:CMP12SSA5.CTRIPL11:CMP12SSA5.CTRIPH12:CMP12SSA6.CTRIPL13:CMP12SSA6.CTRIPH14:CMP12SSA7.CTRIPL15:CMP12SSA7.CTRIPH16:CMP12SSA8.CTRIPL17:CMP12SSA8.CTRIPH18:CMP12SSA9.CTRIPL19:CMP12SSA9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR30_G9" acronym="CONTROLSS_INTXBAR30_G9" offset="2212" width="32" description="INT XBAR 30 Input Select.">
		<bitfield id="INTXBAR30_G9_SEL" width="20" begin="19" end="0" resetval="0x0" description="Corresponding INT XBAR G9 Input Select0:CMP12SSB0.CTRIPL1:CMP12SSB0.CTRIPH2:CMP12SSB1.CTRIPL3:CMP12SSB1.CTRIPH4:CMP12SSB2.CTRIPL5:CMP12SSB2.CTRIPH6:CMP12SSB3.CTRIPL7:CMP12SSB3.CTRIPH8:CMP12SSB4.CTRIPL9:CMP12SSB4.CTRIPH10:CMP12SSB5.CTRIPL11:CMP12SSB5.CTRIPH12:CMP12SSB6.CTRIPL13:CMP12SSB6.CTRIPH14:CMP12SSB7.CTRIPL15:CMP12SSB7.CTRIPH16:CMP12SSB8.CTRIPL17:CMP12SSB8.CTRIPH18:CMP12SSB9.CTRIPL19:CMP12SSB9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR31_G0" acronym="CONTROLSS_INTXBAR31_G0" offset="2240" width="32" description="INT XBAR 31 Input Select.">
		<bitfield id="INTXBAR31_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM INT interrupt to corresponding XBAR1:PWMx.INT is selected0:PWMx.INT is de-selected x can have value from  0 to 31 corresponding to each PWM instance" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR31_G1" acronym="CONTROLSS_INTXBAR31_G1" offset="2244" width="32" description="INT XBAR 31 Input Select.">
		<bitfield id="INTXBAR31_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM TZINT interrupt to corresponding XBAR1:PWMx.TZINT is selected0:PWMx.TZINT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR31_G2" acronym="CONTROLSS_INTXBAR31_G2" offset="2248" width="32" description="INT XBAR 31 Input Select.">
		<bitfield id="INTXBAR31_G2_SEL" width="32" begin="31" end="0" resetval="0x0" description="Corresponding INT XBAR G2 Input SelectBit0:ADC0.INT1Bit1:ADC0.INT2Bit2:ADC0.INT3Bit3:ADC0.INT4Bit4:ADC0.EVTINTBit5:ADC1.INT1Bit6:ADC1.INT2Bit7:ADC1.INT3Bit8:ADC1.INT4Bit9:ADC1.EVTINTBit10:ADC2.INT1Bit11:ADC2.INT2Bit12:ADC2.INT3Bit13:ADC2.INT4Bit14:ADC2.EVTINTBit15:ADC3.INT1Bit16:ADC3.INT2Bit17:ADC3.INT3Bit18:ADC3.INT4Bit19:ADC3.EVTINTBit20:ADC4.INT1Bit21:ADC4.INT2Bit22:ADC4.INT3Bit23:ADC4.INT4Bit24:ADC4.EVTINTBit 2530:ReservedBit31:ASC_AGG0.INT" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR31_G3" acronym="CONTROLSS_INTXBAR31_G3" offset="2252" width="32" description="INT XBAR 31 Input Select.">
		<bitfield id="INTXBAR31_G3_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G3 Input Select0:FSIRX0.INT1N1:FSIRX0.INT2N2:FSIRX1.INT1N3:FSIRX1.INT2N4:FSIRX2.INT1N5:FSIRX2.INT2N6:FSIRX3.INT1N7:FSIRX3.INT2N8:FSITX0.INT1N9:FSITX0.INT2N10:FSITX1.INT1N11:FSITX1.INT2N12:FSITX2.INT1N13:FSITX2.INT2N14:FSITX3.INT1N15:FSITX3.INT2N" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR31_G4" acronym="CONTROLSS_INTXBAR31_G4" offset="2256" width="32" description="INT XBAR 31 Input Select.">
		<bitfield id="INTXBAR31_G4_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G4 Input Select0:SD0.ERR1:SD0.FILT1.DRINT2:SD0.FILT2.DRINT3:SD0.FILT3.DRINT4:SD0.FILT4.DRINT5:SD1.ERR6:SD1.FILT1.DRINT7:SD1.FILT2.DRINT8:SD1.FILT3.DRINT9:SD1.FILT4.DRINT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR31_G5" acronym="CONTROLSS_INTXBAR31_G5" offset="2260" width="32" description="INT XBAR 31 Input Select.">
		<bitfield id="INTXBAR31_G5_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G5 Input Select0:ECAP0.INT1:ECAP1.INT2:ECAP2.INT3:ECAP3.INT4:ECAP4.INT5:ECAP5.INT6:ECAP6.INT7:ECAP7.INT8:ECAP8.INT9:ECAP9.INT10:ECAP10.INT11:ECAP11.INT12:ECAP12.INT13:ECAP13.INT14:ECAP14.INT15:ECAP15.INT" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR31_G6" acronym="CONTROLSS_INTXBAR31_G6" offset="2264" width="32" description="INT XBAR 31 Input Select.">
		<bitfield id="INTXBAR31_G6_SEL" width="3" begin="2" end="0" resetval="0x0" description="Corresponding INT XBAR G6 Input Select0:EQEP0.INT1:EQEP1.INT2:EQEP2.INT" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR31_G7" acronym="CONTROLSS_INTXBAR31_G7" offset="2268" width="32" description="INT XBAR 31 Input Select.">
		<bitfield id="INTXBAR31_G7_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G7 Input SelectBit0:ADCR0.INT1Bit1:ADCR0.INT2Bit2:ADCR0.INT3Bit3:ADCR0.INT4Bit4:ADCR0.EVTINTBit5:ADCR1.INT1Bit6:ADCR1.INT2Bit7:ADCR1.INT3Bit8:ADCR1.INT4Bit9:ADCR1.EVTINTBit 1031:Reserved" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR31_G8" acronym="CONTROLSS_INTXBAR31_G8" offset="2272" width="32" description="INT XBAR 31 Input Select.">
		<bitfield id="INTXBAR31_G8_SEL" width="20" begin="19" end="0" resetval="0x0" description="Corresponding INT XBAR G8 Input Select0:CMP12SSA0.CTRIPL1:CMP12SSA0.CTRIPH2:CMP12SSA1.CTRIPL3:CMP12SSA1.CTRIPH4:CMP12SSA2.CTRIPL5:CMP12SSA2.CTRIPH6:CMP12SSA3.CTRIPL7:CMP12SSA3.CTRIPH8:CMP12SSA4.CTRIPL9:CMP12SSA4.CTRIPH10:CMP12SSA5.CTRIPL11:CMP12SSA5.CTRIPH12:CMP12SSA6.CTRIPL13:CMP12SSA6.CTRIPH14:CMP12SSA7.CTRIPL15:CMP12SSA7.CTRIPH16:CMP12SSA8.CTRIPL17:CMP12SSA8.CTRIPH18:CMP12SSA9.CTRIPL19:CMP12SSA9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR31_G9" acronym="CONTROLSS_INTXBAR31_G9" offset="2276" width="32" description="INT XBAR 31 Input Select.">
		<bitfield id="INTXBAR31_G9_SEL" width="20" begin="19" end="0" resetval="0x0" description="Corresponding INT XBAR G9 Input Select0:CMP12SSB0.CTRIPL1:CMP12SSB0.CTRIPH2:CMP12SSB1.CTRIPL3:CMP12SSB1.CTRIPH4:CMP12SSB2.CTRIPL5:CMP12SSB2.CTRIPH6:CMP12SSB3.CTRIPL7:CMP12SSB3.CTRIPH8:CMP12SSB4.CTRIPL9:CMP12SSB4.CTRIPH10:CMP12SSB5.CTRIPL11:CMP12SSB5.CTRIPH12:CMP12SSB6.CTRIPL13:CMP12SSB6.CTRIPH14:CMP12SSB7.CTRIPL15:CMP12SSB7.CTRIPH16:CMP12SSB8.CTRIPL17:CMP12SSB8.CTRIPH18:CMP12SSB9.CTRIPL19:CMP12SSB9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register>
</module>